// ==UserScript==
// @name        Naumen Tweaks
// @namespace   Naumen Tweaks
// @description Набор твиков, облегчающий и ускоряющий работу с NaumenCRM.
// @author      freetushkan
// @include     https://crm.o.westcall.spb.ru*
// @include     https://crm.westcall.spb.ru*
// @version     4.20.16
// @date        2025-11-23
// @grant       GM_addStyle
// @run-at      document-end
// @downloadURL https://gist.github.com/freetushkan/819343498d988b6a8ffe25ee157ff2d2/raw/NaumenTweaks.user.js
// ==/UserScript==


////2025-11-23 Включены правки от неизвестного автора:
////////////// - Шаблон для Интернета в едитор (2023-01-31).
////////////// - Шаблон для Телефонии в едитор (Ruda) (2023-04-10).
////////////// Включены правки от @SD_IT (2025-10-18):
////////////// - Подсветка обращений по текущему статусу, кнопки "ВОЛС" и "ДЦ" (2024-09-24).
////////////// - Для услуги интернет "IP адрес услуги" - ссылка проверки сессии в IUPD (2024-09-26).
////////////// - Проверка сессии v2.0 - Выведена на кнопку "Найти сессию" + добавлена на страницу заявки (2024-10-20).
////////////// - Подсветка обращений "на мне" (2024-12-07).
////////////// - Кнопка "Цитата" в редакторе (2025-02-24).
////////////// - Кнопка для открытия Админ-панели ОАТС с поиском домена (2025-06-24).
////////////// - Кнопка Найти сессию (2025-10-18).
//////////////   (fixed) При нескольких выбранных на заявке услугах, кнопка отображалась некорректно либо не отображалось вовсе.
//////////////   (added) Отображение кнопки при входе на услугу "Доп. услуги Интернет".
////////////// - Добавлены горячие клавиши в редакторе (2025-10-18).
//////////////   Жирный - Ctrl+B, Курсив - Ctrl+I, Подчёркнутый - Ctrl+U, H1 - Ctrl+H, [Цитата] - Ctrl+Y, Ссылка - Ctrl+K
////////////// - Подсветка ФИО в таблице отображения тикетов (2025-10-18).
//////////////   ФИО задаётся в меню настройки скрипта (правый верхний угол) из списка (используются данные текущей страницы).
////2025-07-04 Фикс костыльно прописанных окон.
////2025-07-03 Актуализация, замена хардкода настройками.
////////////// Включены правки ООКК:
////////////// - Отделы под ТТ ТПКК СПб в Наумне (2021-03).
////////////// - Отделы под ООКК и в регистрацию быстрых обращений (2022-06-20).
////////////// - Отдел ОСФК в ТТ (2022-04).
////////////// - Поиск по email, отделы, изменены названия под ООКК (2023-02-09).
////2021-09-22 Двойное выполнение авторесайза - пустот от скроллбаров оставаться не должно, уменьшение стандартной задержки (200->100мс).
////2021-09-21 Правки авторесайза (надеюсь, без регрессий).
////2021-09-13 Добавлен быстрый поиск по IP услуги, фикс адаптированного прямого перхода (баг вебкита?).
////2021-09-03 Выбор "Выполнено" по-умолчанию, при смене состояний задач.
////2020-02-14 Адаптация предпросмотра обращений ЮЛ, мелкие фиксы.
////2019-09-06 Фикс альтернативной фильтрации списка оповещаемых.
////2019-04-19 Фикс регекса страницы полной истории.
////2019-03-30 Обновил регекс копирования адреса задачи (оно ещё кому-нибудь надо?).
////2019-03-12 Упрощённый поиск по ФИО/логину сотрудника, удалена "Группа мониторинга" ДДС, которой больше нет.
////2019-02-06 Упрощённый поиск по номеру договора и ИНН.
////2019-01-17 Локальные заметки на каждой странице и для любой страницы с uuid, правка в очистке заметок, очищен нереализованный код, мелкие правки.
////2019-01-14 Мелкая правки (копирование номера, очистка данных скрипта, ресайз предпросмотра).
////2018-12-25 Мелкие правки.
////2018-12-20 Мелкие правки.
////2018-12-02 Мелкая правка, регекс поиска ссылок теперь более точен.
////2018-11-18 Мелкие правки, возможно потребуется сменить все innerText на textContent (innerText местами был пустым в Chrome).
////2018-11-01 Мелкие правки.
////2018-09-28 Мелкие правки.
////2018-09-26 Массовое удаление дополнительных связей, предупреждение о миграции в предпросмотре.
////2018-09-24 Отправка по Ctrl+Enter, "Группа мониторинга" (ГМ), чистка объекта только от траблов без заметок.
////////////// И возможно разработка сдохла. И вообще WestCall R.I.P.
////2018-09-02 Небольшие правки.
////2018-08-26 Альтернативная фильтрация списка оповещаемых, вывод заметок на странице обращений, небольшие правки.
////2018-08-23 Заметки к траблам (бета), небольшие правки.
////2018-08-15 Небольшие правки и улучшения, localStorage местами заменён на sessionStorage.
////2018-08-14 Замена неразрывных пробелов, раздувавших ширину некоторых страниц, примечания к траблам (очень бета).
////2018-08-03 Упрощённый поиск продолжает усложняться - теперь четыре запроса (возможно пофиксит баги наумена).
////2018-08-01 Добавлен include домена crm.westcall.spb.ru.
////2018-07-31 Исправление снятия выделения активного поля в упрощённом поиске, фикс нахождения "двойных" ссылок, при наличии в них амперсанда.
////2018-07-29 Мелкие правки.
////2018-07-26 Немного переписан счётчик обращений (имена в алфавитном порядке, вместо порядка появления), новые опции, обновление инфы, мелкие правки.
////2018-07-25 Заменён переключатель поиска, дополнительные проверки, прямой переход при единственном найденном результате, ФИО, замена пробелов "*", округление корректировки.
////2018-07-22 Быстрый поиск (релиз), скрытие других длинных столбцов, новые опции, мелкие правки.
////2018-07-21 ЛКС заменён на ОРСКС, копирование причины отмены задачи.
////2018-07-19 Быстрый поиск (очень бета), доработка скрытия содержимого длинных столбцов в поиске, мелкие правки.
////2018-07-18 Скрытие заявок по точке присутствия в результатах поиска переписано опять (за идею подсчёта спасибо Мише).
////2018-07-17 Улучшен Trim в редакторе, добавлен "Департамент линейно-кабельной сети" (ЛКС).
////2018-07-14 Скрытие заявок по точке присутствия в результатах поиска переписано по-человечески.
////2018-07-13 Скрытие заявок по точке присутствия в результатах поиска.
////2018-07-10 Подстановка дилера ДДС на территории.
////2018-07-05 Фикс бага NaumenCRM в обработке семизначных номеров.
////2018-06-28 Информация о текущей версии, обновление инфы в настройках.
////2018-06-27 Автообновление воскресло вместе с моим аккаунтом облака вестколла, но лучше переехать на GitHubGist.
////2018-06-25 Никто не форкнул, ну и ладно.. Адаптация к новым номерам-ссылкам. Правка кодстайла, ликвидация массы алертов и ворнингов, новые баги.
////2017-11-26 Значительно изменён алгоритм авторесайза, чистка устаревшего кода, мелкие правки. Последняя версия от меня. Кто форкнет?
////2017-11-23 Оптимизация автоподбора окна, мелкие правки.
////2017-11-22 Замена Cookies на localStorage, мелкие правки.
////2017-11-20 Критическая правка регекса, не соответствующего JS.
////2017-11-18 Доработка MutationObserver, мелкие правки.
////2017-11-17 Изменён алгоритм автоподбора размера окна (MutationObserver), старый алгоритм пока доступен в опциях.
////////////// Автоматическая подстановка описания новой задачи из обращения, мелкие правки.
////2017-11-14 Исправления в алгоритме поиска номеров и ссылок.
////2017-11-06 Мелкие правки.
////2017-11-05 Улучшения в обработке изменения размеров текстового поля.
////2017-11-02 Оптимизация обработки изменения размеров текстового поля.
////2017-11-01 Поднятие окна при скролле, если оно опустилось ниже видимой части экрана.
////2017-10-29 Мелкие правки.
////2017-10-26 Ответственное подразделение для обращений и задач по авариям.
////2017-10-25 Опция поведения кнопок редактора, мелкие правки.
////2017-10-24 Небольшие правки в редакторе, редактирование связанных услуг из предпросмотра обращения.
////2017-10-20 Исправление потери установленной высоты панели предпросмотра.
////2017-10-17 Копирование ссылки на обращение из предпросмотра, критическое исправление поведения плавающей панели предпросмотра.
////////////// Исправление обработки исключений при копировании текста задачи, оптимизация автоподбора размера окна, мелкие правки.
////2017-10-16 Оптимизация автоподбора размера окна, адаптация к длинным шаблонам, сокращён скрипт тега <bl> (мигающий текст).
////////////// Редактор (без неподдерживаемых тегов) в окнах смены состояния задач и комментариев, всплывающие подсказки на кнопках редактора.
////////////// Небольшие изменения в загрузке сотрудников отделов, мелкие правки, оповещение об изменениях в разделе настроек.
////2017-10-14 В ответственные отделы добавлена "Группа поддержки клиентов IP-телефонии (ГПКТ), перенос кнопок в выборе ответственных отделов.
////////////// Обратный отсчёт до обновления страницы, реорганизация кнопок редактора, удаление лишних пробелов (Trim), оптимизация и множественные правки кода.
////2017-10-13 Добавлен отдел энергоснабжения (ОЭ), правка контактов абонента в передпросмотре обращений, "исправление" бага CRM с обработкой семизначных номеров.
////////////// Переписано хранение настроек, в настройки добавлено редактирование шаблонов (очень бета).
////2017-10-12 Обработка регистрации обращений (точки присутствия, таблицы обращений), настройка авзозаполнения, правка регекса поиска КТ, мелкие правки, оптимизация.
////2017-10-10 Исправление в быстром выборе типа обращения.
////2017-10-09 В предпросмотр обращения добавлены контакты и ссылка на абонента, поддержка страницы электронных писем, правка регекса поиска номеров, мелкие правки.
////2017-10-08 Переписан раздел настроек, опция быстрого выбора типа обращения, отображение оборудования и S/N в предпросмотре задач, небольшие исправления.
////2017-10-05 Добавлены новые настройки, небольшие исправления.
////2017-10-04 Возвращён старый вариант предпросмотра, визуальные правки настроек скрипта, небольшие правки и "Комментарий к отмене" в предпросмотре задач.
////2017-10-03 Страница настроек скрипта (больше кастомизации), в смену состояний добавлен "Отдел технического учета" (ОТУ).
////2017-09-30 Исправления и доработки в предпросмотре задач, кликабельные ссылки из текста, мелкие правки.
////2017-09-28 Небольшие исправления в предпросмотре задач и ссылках редактора.
////2017-09-23 Возвращён таймаут авторесайза (200мс), исправление алгоритма поиска КТ.
////2017-09-22 Правка функции telnet в редакторе.
////2017-09-20 Правка в действии кнопки "Стандартный список" полного списка сотрудников, полные названия подразделений при наведении и клике.
////2017-09-19 Авторесайз окна после подгрузки ответственного подразделения, исправление и ускорение авторесайза, мелкие правки.
////2017-09-15 Изменение габаритов и переноса строк в счётчике обращений, попытка отладки авторесайза, отладочные сообщения в консоли.
////2017-09-14 Очистка пустых телефонных номеров.
////2017-09-09 Ответственное подразделение при смене состояния задачи.
////2017-09-07 Мелкие правки.
////2017-09-06 Ответственное подразделение при регистрации задачи, добавлен Отдел Станционных Сооружений (ОСС).
////2017-09-03 В редактор добавлена кнопка Bl, имитирующая действие тега <blink>.
////2017-09-02 Исправление ФИО в копировании задачи, массовая смена ответственного зависит от контекста страницы, исправления в предпросмотре обращений.
////////////// Переписана функция получения сотрудников отдела, возможно получение сотрудников любого отдела по его идентификатору.
////2017-08-30 Небольшие исправления в фильтрации обращений, предпросмотр траблов привязывается к странице, аналогично фильтрации.
////2017-08-29 Фильтрация привязывается к конкретной странице, включая точки присутствия, search заменён на indexOf.
////////////// Прочие улучшения фильтрации, попытка сокращения потребления памяти скриптом.
////2017-08-26 Исправление бесконечного цикла поиска КТ, фильтр строк на странице обращений.
////2017-08-25 Копирование текста задачи вынесено в отдельную функцию, мелкие правки.
////2017-08-23 Правка регекса поиска номеров (для 812XXXXXXX), реорганизация кода, копирование текста задачи со страницы задачи.
////2017-08-22 Переписано копирование задачи в буфер обмена, обработка исключений, оптимизация, мелкие правки.
////2017-08-21 Копирование номера по клику доработано, копирование происходит напрямую в буфер обмена, с уведомлением, мелкие правки.
////2017-08-18 Ответственное подразделение на страницах обращения, контрагента, услуги, на панели предпросмотра и в окне смены состояния.
////////////// Возвращён на место пароль ЛК и прежняя ссылка, номер телефона по клику (бета), мелкие правки.
////2017-08-17 Асинхронная загрузка предпросмотра задач (не замедляет страницу).
////2017-08-14 Предпросмотр задач на странице полной истории обращения, мелкие правки.
////2017-08-13 Шаблоны заменяют выбранную в тексте позицию, а не добавляются в конец, как раньше.
////2017-08-10 Показ/минимизация предпросмотра задачи по клику, новый стандарт XMLHttpRequest, оптимизация костылей, автообновление скрипта.
////2017-08-09 Доработка в предпросмотра задач, копирование текста, автоскрытие предпросмотра, список услуг, исправлено обновление.
////////////// Препятствие выделению текста, при изменении высоты панели предпросмотра, исправление автовыбора состояния "Закрыто".
////2017-08-06 Багфиксы в редакторе, улучшения в исправлении раскладок, оптимизация загрузки предпросмотра обращений, предпросмотр задач.
////2017-08-05 Цвет и размер панели, адаптирующиеся к стилю страницы, автоматический выбор "Закрыто" при смене состояния обращения.
////////////// Правки редактора, кнопка подстановки текущего шаблона, исправление раскладки в редакторе.
////2017-08-03 Скрытие панели оповещённых для всех окон добавления комментариев, полностью переписан редактор текста.
////2017-08-02 Оптимизация, чистка кода, директива "use strict", ссылка [выдать задачу] в двухпанельном просмотре.
////2017-08-01 Двухпанельный просмотр на точке присутствия, индикация строки после перезагрузки страницы.
////////////// Оптимизация ресайза при добавлении оповещаемых. Фиксы, чистка, комментирование.
////////////// Редактор отключен для комментариев, не поддерживающих теги.
////2017-07-29 Предпросмотр обращений полностью переписан, теперь это отдельная панель, запоминающая установленную высоту и выбранное обращение.
////////////// Добавлено хранение параметров в Cookie, ссылки, сделанные в редакторе, открываются в новом окне (target="_blank").
////////////// Убран хак, препятствовавший автообновлению родительских окон, т.к. более в нём нет необходимости.
////2017-07-27 Отображение 200 обращений вместо 100.
////2017-07-25 Дочерние окна предпросмотра позиционируются около курсора, закрепление верхней строки предпросмотра, редактор в задачах.
////2017-07-24 Дочерние окна больше не обновляют родительское при открытии из предпросмотра (грязный хак, но ничего не поделаешь).
////2017-07-21 Кнопка СТП в окне смены состояний. Подтверждение массовой передачи. Оптимизация.
////2017-07-20 Массовая смена ответственного теперь включает в себя также передачу внутри отдела (для некоторых траблов).
////////////// Закрепление предпросмотра обращения, перевод всех запросов в коде на новую функцию. Оптимизация.
////2017-07-19 Универсальная функция синхронных/асинхронных запросов по url, с последующими действиями.
////////////// Оптимизация работы предпросмотра сообщений (асинхронные запросы, ссылки, автоочистка через 30 сек, плейсхолдер).
////2017-07-16 Предпросмотр истории и ссылки обращения со страницы обращений (при наведении курсора на чекбокс), оптимизация.
////2017-07-15 Оптимизация автоматического ресайза (менять размер при необходимости, препятствовать параллельной работе нескольких копий функции).
////////////// Отложенный запуск авторесайза (если не срабатывает, пробуем задать таймаут побольше, строка 65, значения в мс).
////////////// Запуск авторесайза только если был назначен запуск стандартного и в нём есть необходимость.
////2017-07-14 Ссылка [передать внутри отдела] скопирована в раздел истории обращения, убрал смайлы. Зло.
////2017-07-12 Улучшено позиционирование, при клике на select, автоматическая прокрутка до истории обращения.
////////////// Автоматический выбор услуги, при регистрации обращения, если она одна.
////2017-07-09 Фикс автоматического размера и положения окна для Firefox (при работе на втором мониторе).
////////////// Select увеличивается по клику, массовая смена ответственного за обращения.
////2017-07-07 Ещё больше оптимизации изменения размера окна, выбор ответственного, аналогично выбору шаблонов.
////////////// Больший размер для select и option, переписана функция дополнительных ссылок.
////////////// Дублирование ссылки выдачи задачи в верхней панели, фикс автоматического размера и положения окна для Firefox.
////2017-07-05 Полноразмерные select'ы, выбор шаблона по клику, возврат к стандартному списку окна смены ответственного.
////////////// Оптимизация автоматического изменения размера окна.
////2017-07-03 Десяток includ'ов заменён на полный домен, полный список СТП отображается по нажатию отдельной кнопки.
////////////// Изменения в автозаполнении смены состояния обращений, исправление работы редактора.
////////////// Редактор в дополнительной информации, прибрался в коде.
////2017-07-02 Автозаполнение окна выдачи задачи, кнопки выбора ответственного, полный список сотрудников СТП.
////2017-06-29 Улучшения редактора, фикс предпросмотра, кнопки смены состояний вместо select.
////////////// Автозаполнение формы в окне смены состояния, улучшения автоматического размера окна.
////2017-06-28 Реорганизация кода, собственные шаблоны для разных типов окон, функция заполнения анкеты контроля качества.
////2017-06-25 Собрал воедино всё, что было ранее сделано мной и Мишей для NaumenCRM.


"use strict";

///////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////
/////// Используемые типы обращений и ответственные ///////
///////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////
let objIds = {
    requestTypes: ["Типы обращений", localStorage.requestTypes || `
        other_UL92 | Вопрос по услугам
        paymentreq | Оплата
        other_UL91 | Вопрос по договору
        other_UL95 | Отчетность
        other_UL5 | Обращения ДЦ
        Switchontemporarily | Включить временно
        Switchofftemporarily | Отключить временно ВСЕ УСЛУГИ
        disconForeverUL | Отключить навсегда (ЮЛ)
        other_UL991 | Потенциальное отключение
        techSup | Устранение технической неисправности
        temp_readr | Временное решение: Переадресация
        reSign | Перезаключение договора
        other_UL96 | Завести/исправить начисления
        other_UL97 | Корректировка
        reductioncharge | Уменьшение начислений
        servicestop | Приостановка услуг
        additionWork | Проведение доп. работ
        #technicalProblem | Техническая поддержка
        #x_otherSubjects | Общее
        #tarif_change | Смена тарифного плана
        #tariff_stop | Работа по удержанию абонентов
        #contrTermination | Заявление на расторжение
        #disconnectForEver_2 | Отключить навсегда
        #workequipm | Работа по возврату оборудования
        #reActivation | Повторное подключение
        #remoteconnection | Удаленное подключение
        #readrUs | Перенос услуг ФЛ
        #serviceConsultation | Консультация
        #debitorka | Работа с дебиторкой
    `],
    responsibles: ["Ответственные", localStorage.responsibles || `
        corebo180580g0000i8li5a87ilb80u4 | ООК | Отдел обслуживания клиентов
        corebo18058200000ocalu5qtitlosfc | Приборки | Группа обслуживания КК M&A
        corebo180580g0000i8li5f2oueiengo | Дебиторы | Сектор по работе с дебиторской задолженностью
        corebo180580g0000i8li5boi1u6pgrk | ИБС |  Группа эксплуатации ИБС и аналитики данных
        corebo18058200000lbinju9a46rkt9k | ДО | Административная группа
        corebo180580g0000i8li5a8n2l5pofs | ООК B2G | Отдел по работе с госструктурами
        corebo18058200000nvfu5ua4vcef48c | ООК B2F |  Группа договорного обслуживания клиентов b2f

        corebo18058200000n11ne5btnui1kik | Группа Борисовой | Группа Борисовой М.А.
        corebo18058200000n11n7f93u8i3760 | Группа Гук | Группа Гук Н.
        corebo18058200000n11ne5csgilqehs | Группа Владимировой | Группа Владимировой Н.А.
        corebo180580g0000i8li5clc6c5v96c | VIPы | Группа по работе с крупными клиентами

        corebo18058200000mrbvo9lotsr1g9s | ТП | Группа поддержки и управления сетью
        corebo18058200000mrbvo9j4ito9rtg | НКУ | Группа инсталляции (Напр сервиса В2В)
        corebofs000080000ii4acd5opc2lm4s | Телефония | Направление сопровождения сети передачи голосового трафика и TDM (ЦП)
        corebofs000080000kbddq27v5b8cjhg | IP-телефония | Группа поддержки клиентов IP-телефонии (Напр сопровожд сети ПГТ и TDM)
        corebo18058200000mrc5v252ugor7e8 | Выездные | Направление технического сервиса клиентов B2B
        corebo180580g0000i8li5bq944bo9b8 | Инф. системы | Группа эксплуатации информационных систем (Напр ИТ)
        corebo18058200000mrbvo9l5m97qlek | СТСК | Служба технического сопровождения клиентов (СТСК)
        corebofs000080000ii4acd5opc2lm4s | Телефония ОТДЕЛ | Направление сопровождения сети передачи голосового трафика и TDM (ЦП)
        corebo18058200000o02bdq32j1k68tc | ОСФК | Отдел сопровождения федеральных клиентов (ОСФК)
        corebo18058200000mrakvoclvbg8j1s | ВОЛС | Направление ВОЛС
        corebofs000080000ke13natnt54jrro | ДЦ | Направление технической поддержки и эксплуатации дата-центра
    `]
}


let requestTypes = {},
    responsibles = {},
    breakCount = 1;
objIds.requestTypes[1].trim().split('\n').forEach(line => {
    const trimmed = line.trim();
    if (trimmed.startsWith('#')) return;
    const [key, name] = trimmed.split('|');
    if (key && name) {
        requestTypes[key.trim()] = name.trim();
    }
});
objIds.responsibles[1].trim().split('\n').forEach(line => {
    const trimmed = line.trim();
    if (trimmed.startsWith('#')) return;
    if (trimmed === '') {
        responsibles[`break${breakCount++}`] = 'break';
        return;
    }
    const [key, tag, name] = trimmed.split('|');
    if (key && tag && name) {
        responsibles[key.trim()] = [tag.trim(), name.trim()];
    }
});

/////////////////////////////////
/////////////////////////////////
/////// Настройки скрипта ///////
/////////////////////////////////
/////////////////////////////////

// Перечень настроек и возможных параметров.
var parameters = {
    username:
    ['ФИО для подсвечивания в таблице с ТТ',
     getWorkers(getParameterFromUrl('uuid')),
     localStorage.username || ' - - - - - -'
    ],
    colorUsername: ['Окрас ФИО в таблице с ТТ',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.colorUsername || '1'
    ],
    taskKrus: ['Быстрый просмотр ТТ в КРУС',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.taskKrus || '1'
    ],
    taskPreview: ['Предпросмотр задач',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.taskPreview || '1'
    ],
    requestPreview:
    ['Предпросмотр обращений',
     {0: 'Отключить', 1: 'Фиксированная панель', 2: 'Всплывающая панель'},
     localStorage.requestPreview || '0'
    ],
    requestFilter:
    ['Быстрый фильтр обращений',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.requestFilter || '1'
    ],
    requestsMassChange:
    ['Массовая смена ответственного за обращения',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.requestsMassChange || '1'
    ],
    requestsCounter:
    ['Счётчик обращений',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.requestsCounter || '0'
    ],
    requestsPageExtend:
    ['Отображение 200 обращений на странице вместо 100',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.requestsPageExtend || '1'
    ],
    refreshCountdown:
    ['Обратный отсчёт обновления страницы',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.refreshCountdown || '1'
    ],
    clickableLinks:
    ['Кликабельные ссылки и номера',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.clickableLinks || '1'
    ],
    regRequestAutofill:
    ['Автозаполнение окна регистрации обращения',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.regRequestAutofill || '1'
    ],
    defaultRequestType:
    ['Тип обращения на контрагенте по умолчанию',
     requestTypes,
     localStorage.defaultRequestType || 'paymentreq'
    ],
    quickRequest:
    ['Быстрый выбор типа обращения',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.quickRequest || '1'
    ],
    responsibleDepartment:
    ['Отображение ответственного подразделения',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.responsibleDepartment || '0'
    ],
    showAccountInfo:
    ['Отображение логина и пароля аккаунта',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.showAccountInfo || '1'
    ],
    autoResize:
    ['Автоматический подбор размера окна',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.autoResize || '1'
    ],
    autoResizeTimeout:
    ['Задержка автоподбора размера окна',
     {75: '75 мс', 100: '100 мс', 125: '125 мс', 150: '150 мс', 175: '175 мс',
      200: '200 мс', 225: '225 мс', 250: '250 мс', 275: '275 мс', 300: '300 мс'},
     localStorage.autoResizeTimeout || '200'
    ],
    fullsizeSelects:
    ['Полноразмерные раскрывающиеся списки',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.fullsizeSelects || '1'
    ],
    hideNotifyBlock:
    ['Минимизация списка оповещаемых',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.hideNotifyBlock || '1'
    ],
    filterNotifyBlock:
    ['Альтернативная фильтрация списка оповещаемых',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.filterNotifyBlock || '1'
    ],
    textEditor:
    ['Редактор текстовых полей',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.textEditor || '1'
    ],
    textEditorHot:
    ['Редактор текстовых полей горячими клавишами',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.textEditorHot || '1'
    ],
    textEditorBehavior:
    ['Поведение редактора текстовых полей',
     {0: 'Переходить в конец текста', 1: 'Выделять обработанный текст'},
     localStorage.textEditorBehavior || '1'
    ],
    textTemplates:
    ['Шаблоны текстовых полей',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.textTemplates || '1'
    ],
    hideInSearchResults:
    ['Скрытие длинных списков в столбцах результатов поиска',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.hideInSearchResults || '1'
    ],
    quickSearch:
    ['Упрощённый поиск',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.quickSearch || '1'
    ],
    quickSearchForceOpen:
    ['Действие упрощённого поиска',
     {0: 'Переход к результатам', 1: 'Прямой переход в результат', 2: 'Прямой переход в результат (адаптивный)'},
     localStorage.quickSearchForceOpen || '2'
    ],
    quickSearchSpaceToAsterisk:
    ['Замена пробела на "*" в упрощённом поиске',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.quickSearchSpaceToAsterisk || '1'
    ],
    localNotes:
    ['Краткие заметки (закладки)',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.localNotes || '1'
    ],
    localNotesTTL:
    ['Время хранения заметок',
     {0: 'Хранить всегда', 1: '1 день', 2: '2 дня', 4: '4 дня', 7: '7 дней', 14: '14 дней', 30: '30 дней'},
     localStorage.localNotesTTL || '0'
    ],
    submitCtrlEnter:
    ['Отправка по Ctrl+Enter',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.submitCtrlEnter || '1'
    ],
    experimental:
    ['Экспериментальные функции',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.experimental || '0'
    ],
    colorTable:
    ['Окрас таблицы с ТТ',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.colorTable || '1'
    ],
    colorHistory:
    ['Окрас таблицы с историей ТТ',
     {0: 'Отключить', 1: 'Включить'},
     localStorage.colorHistory || '1'
    ]
};

// Объект шаблонов ответов.
var answerTemplates = {
    addCommentTemplate:
    ['Шаблоны добавления комментария',
     localStorage.addCommentTemplate || 'Нет ответа.\nНедоступен.\nЗанято.\nСброс.\n' +
                'Автоответчик.\nОтправлен новый счет и указано напоминание о долге в письме красными буквами.\nВ выписке \nприслали платежное поручение'
    ],
    setTaskStateTemplate:
    ['Шаблоны смены состояния задачи',
     localStorage.setTaskStateTemplate || 'Выполнено\nподписанные документы в файлах'
    ],
    regRequestClientTemplate:
    ['Шаблоны регистрации обращения на контрагенте',
     localStorage.regRequestClientTemplate || '1С+\nДолжник\n, предоплатник\n' +
                'В выписке \nПрислали ПП\nПросьба в счете и счет-фактуре от __.__ произвести минусовую корректировку на сумму ___ по услуге _____ по причине _____.\nклиент переведен в арм на договор \nНа почту отправлено напоминание об оплате и счета за месяц.'
    ],
    regRequestPointTemplate:
    ['Шаблоны регистрации обращения на точке присутствия',
     localStorage.regRequestPointTemplate || 'Не отвечает коммутатор xxxxx.\nРастут ошибки на магистрали.\n' +
     'Подключен по меди, аплинк xxxxx.\nПодключен по оптике, аплинк xxxxx.\nАДС о работах не сообщали.\n' +
     'Отключали электричество, после включения оборудование не поднялось.\nНеобходима замена коммутатора.'
    ],
    setStateTemplate:
    ['Шаблоны смены состояния',
     localStorage.setStateTemplate || '1С+\nВыполнено\nподписанные документы в файлах.'
    ],
    changeResponsibleTemplate:
    ['Шаблоны смены ответственного',
     localStorage.changeResponsibleTemplate || 'Нет ответа.\nНедоступен.\nЗанято.\nСброс.\nАвтоответчик.\n' +
     'Перезвонить позже.\nАбонент перезвонит сам.\nНе дозвонился.'
    ],
    additionalInfoTemplate:
    ['Шаблоны дополнительной информации на карточке контрагента',
     localStorage.additionalInfoTemplate || 'Свитч 172.17.ххх порт ххх.\nНе хватает фантазии.'
    ]
};

// Страница настроек.
var configVer = '8',
    configLinkBlink,
    pageButtons = document.querySelector('.pageheader .navpath[valign="top"]>nobr');
if (pageButtons) {
    let needReload = false,
        configLink = document.createElement('a');
    pageButtons.parentNode.style.paddingBottom = '2px';
    configLink.innerHTML = '[настройки скрипта]';
    configLink.style.whiteSpace = 'nowrap';
    configLink.style.padding = '2px';
    configLink.href = '';
    // Оповещаем о новых настройках, меняя цвет ссылки.
    if (localStorage.lastConfigVer != configVer) {
        configLink.title = 'Нажмите для просмотра новых настроек скрипта.';
        configLinkBlink = setInterval(function() {
            configLink.style.color = configLink.style.color ? '' : '#d00';
        }, 700);
    }
    configLink.onclick = function(event) {
        event.preventDefault();
        // При открытии настроек убираем "оповещение".
		    localStorage.lastConfigVer = configVer;
        clearInterval(configLinkBlink);
        configLink.style.color = '';

        let configWrap = document.createElement('div');
        configWrap.style.zIndex = '1015';
        configWrap.style.position = 'fixed';
        configWrap.style.top = '0px';
        configWrap.style.left = '0px';
        configWrap.style.width = '100%';
        configWrap.style.height = '100%';
        configWrap.style.background = 'rgba(50,50,50,0.5)';
        configWrap.onclick = function(event) {
            if (event.target == this) {
                this.remove();
                if (needReload) {
                    location.reload();
                }
            }
        };
        document.body.appendChild(configWrap);

        let configContainer = document.createElement('div');
        configContainer.style.position = 'relative';
        configContainer.style.width = '50%';
        configContainer.style.top = '15px';
        configContainer.style.maxHeight = 'calc(100% - 60px)';
        configContainer.style.overflowY = 'auto';
        configContainer.style.margin = 'auto';
        configContainer.style.padding = '15px';
        configContainer.style.background = '#ddd';
        configContainer.style.color = '#444';
        configContainer.innerHTML = '<span style="font-size: 12pt; font-weight: bold;">Параметры Naumen Tweaks</span><br><br>';
        configWrap.appendChild(configContainer);

        // Блокируем прокрутку любых элементов, кроме блока настроек.
        configWrap.onwheel = function(event) {
            // Если элемент события прокрутки не принадлежит истории, ничего не делаем.
            if (! isChildOf(event.target, configWrap)) event.preventDefault();

            let area = configContainer,
                delta = event.deltaY || event.detail || event.wheelDelta;

            if (delta < 0 && area.scrollTop === 0) {
                event.preventDefault();
            }
            if (delta > 0 && area.scrollHeight - area.clientHeight - area.scrollTop <= 1) {
                event.preventDefault();
            }
        };

        // Добавляем параметры.
        for (let param in parameters) {
            let select = document.createElement('select');
            select.style.minHeight = '21px';
            select.style.margin = '2px 0';
            select.style.width = '100%';
            select.size = '1';
            select.id = param;
            if (! localStorage[param]) {
                select.innerHTML += '<option value="undefined"></option>';
            }
            for (let option in parameters[param][1]) {
                select.innerHTML += '<option value="' + option + '">' + parameters[param][1][option] + '</option>';
            }
            changeSel(localStorage[param], select, false);
            select.onchange = function() {
                let value = this.options[this.selectedIndex].value;
                if (value != 'undefined') {
					          localStorage[this.id] = value;
                    needReload = true;
                    let emptyOption = this.querySelector('[value="undefined"]');
                    if (emptyOption) {
                        emptyOption.remove();
                    }
                }
            };
            let label = document.createElement('label');
            label.innerHTML = '<b>' + parameters[param][0] + ':</b><br>';
            label.appendChild(select);
            configContainer.appendChild(label);
            configContainer.appendChild(document.createElement('br'));
            configContainer.appendChild(document.createElement('br'));
        }

        // Добавляем поля редактирования шаблонов.
        for (let answers in answerTemplates) {
            let templateLabel = document.createElement('label');
            templateLabel.innerHTML = '<b>' + answerTemplates[answers][0] + ':</b> (по строке на вариант)<br>';
            configContainer.appendChild(templateLabel);

            let answersText = document.createElement('textarea');
            answersText.style.margin = '2px 0';
            answersText.style.width = 'calc(100% - 4px)';
            answersText.style.resize = 'vertical';
            answersText.style.whiteSpace = 'pre';
            answersText.style.boxSizing = 'content-box';
            answersText.id = answers;
            answersText.value = answerTemplates[answers][1];
            answersText.oninput = function() {
				    localStorage[this.id] = this.value;
                needReload = true;
            };
            templateLabel.appendChild(answersText);
            answersText.style.height = answersText.scrollHeight + 'px';

            configContainer.appendChild(document.createElement('br'));
            configContainer.appendChild(document.createElement('br'));
        }

        // Добавляем поля редактирования ответственных и типов обращений.
        for (let idStr in objIds) {
            let templateLabel = document.createElement('label');
            templateLabel.innerHTML = '<b>' + objIds[idStr][0]
                + ':</b> (по строке на вариант, # - игнорировать строку, пустая строка - разделитель)<br>';
            configContainer.appendChild(templateLabel);

            let idsText = document.createElement('textarea');
            idsText.style.margin = '2px 0';
            idsText.style.width = 'calc(100% - 4px)';
            idsText.style.resize = 'vertical';
            idsText.style.whiteSpace = 'pre';
            idsText.style.boxSizing = 'content-box';
            idsText.id = idStr;
            idsText.value = objIds[idStr][1].trim().replace(/\n[ \t]+/g, '\n');;
            idsText.oninput = function() {
				    localStorage[this.id] = this.value;
                needReload = true;
            };
            templateLabel.appendChild(idsText);
            idsText.style.height = idsText.scrollHeight + 'px';

            configContainer.appendChild(document.createElement('br'));
            configContainer.appendChild(document.createElement('br'));
        }

		    let clearConfig = document.createElement('a');
        clearConfig.innerHTML = 'Очистить данные скрипта';
        clearConfig.href = '';
        clearConfig.onclick = function(event) {
            event.preventDefault();
            var isSure = window.confirm('Будут удалены все данные и параметры Naumen Tweaks!\nПродолжить?');
            if (isSure) {
                localStorage.clear();
                sessionStorage.clear();
                location.reload();
            }
            return false;
        };
		    configContainer.appendChild(clearConfig);
        return false;
    };
    pageButtons.parentNode.appendChild(configLink);
}

///////////////////////////////////////
///////////////////////////////////////
/////// Автоподбор размера окна ///////
///////////////////////////////////////
///////////////////////////////////////
var lastOptimalWidth, lastOptimalHeight, resizeNeeded = true;
// Фикс костыльно прописанных окон.
if (window.opener) document.body.setAttribute('onload', 'auto_resize()');
var expr = /auto_resize/;
// Проверяем наличие стандартного auto_resize() в document.body.onload.
if (parameters.autoResize[2] === '1' && expr.test(document.body.onload)) {
	  // Устанавливаем необходимые свойства.
    document.body.style.display = 'table';
    document.documentElement.style.display = 'table';
    // Отменяем стандартный auto_resize() в document.body.onload.
    document.body.onload = function() {};

    var resizeTimeout;
    // Создаём слушатель изменений для функции авторесайза.
    var observer = new MutationObserver(function(mutations) {
        mutations.forEach(function(mutation) {
            if (mutation.target.id === 'tooltip') {
                return;
            }
            // Выполняем отложенный авторесайз.
            clearTimeout(resizeTimeout);
            resizeTimeout = setTimeout(resizeWindow, parameters.autoResizeTimeout[2]*1);
        });
    });

    // Поднимаем окно при скролле, если оно опустилось ниже видимой части экрана.
    window.onwheel = function() {
        var needMoveUp = window.screenY + Math.min(screen.availHeight, window.outerHeight) - screen.availHeight;
        if (needMoveUp > 0) window.moveBy(0, 0 - needMoveUp);
    };
}
else resizeNeeded = false;

///////////////////////////////////
///////////////////////////////////
/////// Все страницы и окна ///////
///////////////////////////////////
///////////////////////////////////
// Добавление общего стиля.
GM_addStyle (`
select, button {min-height: 21px;}
option {padding: 3px;}
#tooltip {z-index: 1010;}
`);

let pageContent = document.querySelector('#publisher_div table.basic tr[height="100%"]');
if (pageContent) {
    // Делаем ссылки и номера кликабельными.
    if (parameters.clickableLinks[2] === '1') {
        modifyTextNodes(pageContent);
    }
}

// Обработка изменения размеров текстового поля.
if (parameters.autoResize[2] === '1') {
    var textareas = document.querySelectorAll('textarea');
    //var textareas = document.querySelectorAll('textarea#text, textarea#cause, textarea#detailedCause, textarea#requestDescription, textarea#otherStuff');
    for (let i=0; i<textareas.length; i++) {
        textareas[i].style.width = '100%';
        if (resizeNeeded) {
            observer.observe(textareas[i], {attributes: true});
        }
    }
}

// Оставляем инфу о версии и времени с последнего изменения/обновления скрипта.
var logoutButt = document.querySelector('input[name="exitButton"]');
if (logoutButt) {
    logoutButt.parentNode.innerHTML += '<br>Naumen Tweaks v' + GM_info.script.version +
        '<br>(обновлён ' + timeFrom(GM_info.script.lastModified) + ')' +
        '<br>© ' + GM_info.script.author + ' 2017-' + (new Date()).getFullYear();
}

// Отправка по Ctrl+Enter.
if (parameters.submitCtrlEnter[2] === '1') {
    let submitButtons = document.querySelectorAll('input[type="submit"]');
    for (let i = 0; i < submitButtons.length; i++) {
        if (/^(add|ok|okdelegate|next|Edit|edit)$/.test(submitButtons[i].id)) {
            //submitButtons[i].title = 'Ctrl+Enter'; // Баг с авторесайсом.
            document.addEventListener('keypress', function(event) {
                if (event.keyCode === 10) {
                    submitButtons[i].click();
                }
            }, false);
            break;
        }
    }
}

// Упрощённый поиск.
addQuickSearch();
if (parameters.quickSearch[2] === '1') {
    let tabView = document.querySelector('#tabView');
    // Создаём слушатель для боковой панели.
    if (tabView) {
        let sidepanelObserver = new MutationObserver(function(mutations) {
            mutations.forEach(function(mutation) {
                if (mutation.target.id === 'tabView') {
                    addQuickSearch();
                }
            });
        });
        sidepanelObserver.observe(tabView, {childList: true});
    }
}

function addQuickSearch() {
    // Ищем формы стандартного и быстрого поиска.
    let searchForm = document.querySelector('#sidepanel\\.advSearchTab\\.searchForm'),
        quickSearchForm = document.querySelector('#sidepanel\\.advSearchTab\\.quickSearchForm');
    // Если стандартная форма поиска существует, а формы быстрого поиска нет, создаём её.
    if (searchForm && ! quickSearchForm) {
        // Создаём объекты ключей для запроса.
        let qw,
            defQueryKeys = {
                searchType__exists: '1',
                fullMatch__exists: '1',
                hidden_search: '1',
                __form_id: 'sidepanel.advSearchTab.searchForm',
                first_load: 'false'
            },
            // Задаём поля быстрого поиска.
            qsTypes = {
                'qsAccNum': {
                    name: 'Лицевой счёт', type: 'ru.naumen.crm2.bobjects.contract.CoreContract', searchKey: 'byAccountNumber',
                    additionalKeys: {fullMatch: 'on'}
                },
                'qsClientNum': {
                    name: 'Номер контрагента', type: 'ru.naumen.crm2.bobjects.client.CoreClient', searchKey: 'byClientNumber',
                    additionalKeys: {fullMatch: 'on', byTitle: '', byPhone: '', byINN: '', byEmail: '', byContractNumber: '',
                                     byCPTitle: '', byHoldingTitle: '', hidden_clear: ''} // WTF?! Зачем наумену пустые переменные?
                },
                'qsContractNum': {
                    name: 'Номер договора', type: 'ru.naumen.crm2.bobjects.client.CoreClient', searchKey: 'byContractNumber',
                    additionalKeys: {fullMatch: '', byTitle: '', byPhone: '', byINN: '', byEmail: '', byClientNumber: '',
                                     byCPTitle: '', byHoldingTitle: '', hidden_clear: ''}
                },
                'qsFIO': {
                    name: 'ФИО контрагента', type: 'ru.naumen.crm2.bobjects.client.CoreClient', searchKey: 'byTitle',
                    additionalKeys: {fullMatch: '', byClientNumber: '', byPhone: '', byINN: '', byEmail: '', byContractNumber: '',
                                     byCPTitle: '', byHoldingTitle: '', hidden_clear: ''}
                },
                'qsINN': {
                    name: 'ИНН контрагента', type: 'ru.naumen.crm2.bobjects.client.CoreClient', searchKey: 'byINN',
                    additionalKeys: {fullMatch: 'on', byClientNumber: '', byPhone: '', byTitle: '', byEmail: '', byContractNumber: '',
                                     byCPTitle: '', byHoldingTitle: '', hidden_clear: ''}
                },
                'qsPhone': {
                    name: 'Номер телефона', type: 'ru.naumen.crm2.bobjects.client.CoreClient', searchKey: 'byPhone',
                    additionalKeys: {fullMatch: ''}
                },
                'qsEmail': {
                    name: 'e-mail', type: 'ru.naumen.crm2.bobjects.client.CoreClient', searchKey: 'byEmail',
                    additionalKeys: {fullMatch: '', byTitle: '', byPhone: '', byINN: '', byClientNumber: '',
                                     byCPTitle: '', byHoldingTitle: ''}
                },
                'qsIP': {
                    name: 'IP услуги', type: 'ru.naumen.crm2.bobjects.service.CRMService', searchKey: 'byIPAddress',
                    additionalKeys: {fullMatch: 'on', byType: '', byAccount: '', byAddress: '', byAddressNearest: '', byAddressBuildingText: '',
                                     byAddressBuildingType: '', byAddressAppartment: '', hidden_clear: ''}
                },
                'qsTaskNum': {
                    name: 'Номер задачи', type: 'ru.naumen.crm.tasks.bobjects.CRMProblem', searchKey: 'byNumber',
                    additionalKeys: {fullMatch: 'on', byStage__exists: '1'}
                },
                'qsReqNum': {
                    name: 'Номер обращения', type: 'ru.naumen.crm.requests.bobjects.CRMRequest', searchKey: 'byNumber',
                    additionalKeys: {fullMatch: 'on'}
                },
                'qsDealNum': {
                    name: 'Номер заявки', type: 'ru.naumen.crm.om.bobjects.deal.OMDeal', searchKey: 'byNumber',
                    additionalKeys: {fullMatch: 'on'}
                },
                'qsPointName': {
                    name: 'Точка присутствия', type: 'ru.naumen.crm.om.bobjects.pop.PointOfPresence', searchKey: 'byTitle',
                    additionalKeys: {fullMatch: ''}
                },
                'qsEmployee': {
                    name: 'Сотрудник (ФИО/логин)', type: 'ru.naumen.core.bobjects.person.CoreEmployee', searchKey: 'byTitle',
                    additionalKeys: {fullMatch: ''}
                },
                'qsAccNum': {
                    name: 'Аккаунт', type: 'ru.naumen.crm2.bobjects.service.CRMService', searchKey: 'byAccount',
                    additionalKeys: {fullMatch: 'on', byStage__exists: ''}
                }
            };

        quickSearchForm = document.createElement('form');
        quickSearchForm.style.margin = '0';
        quickSearchForm.id = 'sidepanel.advSearchTab.quickSearchForm';
        let quickSearchTable = document.createElement('table');
        quickSearchTable.className = 'dialog';
        quickSearchTable.style.minWidth = '240px';
        quickSearchTable.style.width = '100%';
        quickSearchForm.appendChild(quickSearchTable);
        searchForm.parentNode.insertBefore(quickSearchForm, searchForm);

        for (let key in qsTypes) {
            let input = document.createElement('input'),
                row = quickSearchTable.insertRow(-1),
                captionCell = document.createElement("th"),
                inputCell = document.createElement("td");
            row.appendChild(captionCell);
            row.appendChild(inputCell);
            row.className = 'inputRow';

            captionCell.innerHTML = qsTypes[key].name;
            inputCell.style.verticalAlign = 'middle';
            input.id = key;
            input.style.width = '100%';
            input.style.border = '1px solid #a9a9a9';
            input.style.background = '#fff';
            // Выделяем ранее активное поле.
            if (localStorage.qsActiveInput === input.id) {
                input.style.border = '1px solid #36bb36';
                input.style.background = '#deffde';
            }
            // Возвращаем ранее введённый текст.
            let qsInputValues = JSON.parse(localStorage.qsInputValues || '{}');
            input.value = qsInputValues[input.id] || '';
            // Сохранение текста в полях.
            input.oninput = function() {
                let qsInputValues = JSON.parse(localStorage.qsInputValues || '{}');
                qsInputValues[this.id] = this.value;
                localStorage.qsInputValues = JSON.stringify(qsInputValues);
            };
            // Сохранение и выделение активного поля.
            input.onfocus = function() {
                let inputs = quickSearchTable.querySelectorAll('.inputRow input');
                for (let i = 0; i < inputs.length; i++) {
                    inputs[i].style.border = '1px solid #a9a9a9';
                    inputs[i].style.background = '#fff';
                }
                localStorage.qsActiveInput = this.id;
                this.style.border = '1px solid #36bb36';
                this.style.background = '#deffde';
            };
            inputCell.appendChild(input);
        }

        let buttonsCell = quickSearchTable.insertRow(-1).insertCell(-1),
            statusCell = quickSearchTable.insertRow(-1).insertCell(-1),
            searchButton = document.createElement('input'),
            loadingImg = document.createElement('img'),
            status = document.createElement('span');
        buttonsCell.colSpan = '2';
        statusCell.colSpan = '2';
        searchButton.value = 'Поиск';
        searchButton.type = 'submit';
        searchButton.style.margin = '5px';
        loadingImg.src = '/fx/$crm/$ajaxcs/images/ajax-loader.gif';
        loadingImg.style.display = 'none';
        status.style.fontWeight = 'bold';
        status.style.color = 'red';
        buttonsCell.appendChild(searchButton);
        buttonsCell.appendChild(loadingImg);
        statusCell.appendChild(status);

        // Переключатель межу сандартным и быстрым поиском.
        let qsSwitchDiv = document.createElement('div'),
            qsSwitchOnLabel = document.createElement('label'),
            qsSwitchOffLabel = document.createElement('label'),
            qsSwitchOnInput = document.createElement('input'),
            qsSwitchOffInput= document.createElement('input');
        qsSwitchDiv.innerHTML = 'Поиск:';
        qsSwitchOnInput.type = 'radio';
        qsSwitchOffInput.type = 'radio';
        qsSwitchOnInput.name = 'qsSwitch';
        qsSwitchOffInput.name = 'qsSwitch';
        qsSwitchOnInput.value = 'on';
        qsSwitchOffInput.value = 'off';
        qsSwitchOnInput.style.verticalAlign = 'sub';
        qsSwitchOffInput.style.verticalAlign = 'sub';
        qsSwitchOnLabel.appendChild(qsSwitchOnInput);
        qsSwitchOnLabel.appendChild(document.createTextNode('упрощённый'));
        qsSwitchOffLabel.appendChild(qsSwitchOffInput);
        qsSwitchOffLabel.appendChild(document.createTextNode('стандартный'));
        qsSwitchDiv.appendChild(qsSwitchOnLabel);
        qsSwitchDiv.appendChild(qsSwitchOffLabel);
        qsSwitchDiv.style.margin = '2px 5px';
        qsSwitchDiv.style.textAlign = 'right';
        qsSwitchDiv.style.whiteSpace = 'nowrap';

        if (localStorage.hideDefSearch === '0') {
            qsSwitchOffInput.checked = true;
            quickSearchForm.style.display = 'none';
            searchForm.style.display = '';
        }
        else {
            qsSwitchOnInput.checked = true;
            quickSearchForm.style.display = '';
            searchForm.style.display = 'none';
        }
        qsSwitchOnInput.onchange = qsSwitchOffInput.onchange = function() {
            if (this.value === 'on') {
                quickSearchForm.style.display = '';
                searchForm.style.display = 'none';
                localStorage.hideDefSearch = '1';
            }
            else {
                quickSearchForm.style.display = 'none';
                searchForm.style.display = '';
                localStorage.hideDefSearch = '0';
            }
        };
        quickSearchForm.parentNode.insertBefore(qsSwitchDiv, quickSearchForm);

        // Обработка отправки формы.
        quickSearchForm.onsubmit = function(event) {
            event.preventDefault();
            if (! localStorage.qsActiveInput) {
                status.innerHTML = 'Не выбрано поле для поиска!';
                setTimeout(function() {status.innerHTML = '';}, 3000);
                return false;
            }
            let input = quickSearchForm.querySelector('#' + localStorage.qsActiveInput),
                type = qsTypes[input.id].type,
                value = input.value,
                qsTypeCtrlTab = encodeURI('uuid=fakeobnavigator&handler=sidepanel.click' +
                                          '&sidepanel={"active": "advSearchTab", "deactive": "advSearchTab"}' +
                                          '&controlId=sidepanel&code=1'),
                qsTypeCtrlType = encodeURI('uuid=fakeobnavigator&handler=sidepanel.advSearchTab.searchForm.refresh.onclick' +
                                           '&sidepanel={"active": "advSearchTab"}&searchType__exists=1&searchType=' + type +
                                           '&refresh=[не указано]&__form_id=sidepanel.advSearchTab.searchForm' +
                                           '&first_load=true&controlId=sidepanel&code=1'),
                qsQueryKeys = JSON.parse(JSON.stringify(defQueryKeys));
            value = value.trim();
            if (value === '') {
                status.innerHTML = 'Выбранное поле не заполнено!';
                setTimeout(function() {status.innerHTML = '';}, 3000);
                return false;
            }
            // Подменяем пробелы на "*".
            if (parameters.quickSearchSpaceToAsterisk[2] === '1') {
                value = value.replace(/\s+/g, '*');
            }

            qsQueryKeys.searchType = type;
            qsQueryKeys[qsTypes[localStorage.qsActiveInput].searchKey] = value;
            for (let addKey in qsTypes[localStorage.qsActiveInput].additionalKeys) {
                qsQueryKeys[addKey] = qsTypes[localStorage.qsActiveInput].additionalKeys[addKey];
            }
            // Отображаем анимацию загрузки.
            loadingImg.style.display = '';
            // Активируем вкладку поиска.
            getFromUrlPost('/fx/$crm/$ajaxcs/ctrl', true, qsTypeCtrlTab, function(response) {
                // Устанавливаем тип поиска.
                getFromUrlPost('/fx/$crm/$ajaxcs/ctrl', true, qsTypeCtrlType, function(response) {
                    // Отправляем значение для поиска.
                    getFromUrlPost(window.location.href, true, qsQueryKeys, function(response) {
                        // Запрашиваем результаты поиска.
                        let searchResult = '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=coreboqnpd7380000i12mtv3s695au7k&activeComponent=advSearchTab';
                        getFromUrl(searchResult, true, function(response) {
                            var responseDiv = document.createElement ('div');
                            responseDiv.innerHTML = response;
                            let resultTable = responseDiv.querySelector('#advSearchTab\\.searchResults');
                            if (resultTable) {
                                if (resultTable.rows.length > 1) {
                                    // Если результат один и опция прямого перехода включена.
                                    if (resultTable.rows.length === 2 && parameters.quickSearchForceOpen[2]*1 > 0) {
                                        let tableHeaders = responseDiv.querySelectorAll('#advSearchTab\\.searchResults tr:first-child th'),
                                            linkIndex = 1;
                                        if (tableHeaders) {
                                            // Если адаптированный прямой перход включен.
                                            if (parameters.quickSearchForceOpen[2] === '2') {
                                                for (let i=0; i<tableHeaders.length; i++) {
                                                    switch (tableHeaders[i].id) {
                                                        case 'advSearchTab.searchResults.parent.parentheaderCell': {
                                                            linkIndex = i + 1;
                                                            break;
                                                        }
                                                        case 'advSearchTab.searchResults.context.contextheaderCell': {
                                                            linkIndex = i + 1;
                                                            break;
                                                        }
                                                        case 'advSearchTab.searchResults.title.titleheaderCell': {
                                                            linkIndex = i + 1;
                                                            break;
                                                        }
                                                    }
                                                }
                                            }
                                            let cell = resultTable.rows[1].querySelector('td:nth-child(' + linkIndex + ')');
                                            if (cell) {
                                                let link = cell.querySelector('a');
                                                if (cell) searchResult = link.href;
                                            }
                                        }
                                    }
                                }
                                else {
                                    // Скрываем анимацию.
                                    loadingImg.style.display = 'none';
                                    status.innerHTML = 'Поиск не дал результатов.';
                                    setTimeout(function() {status.innerHTML = '';}, 3000);
                                    return false;
                                }
                                // Осуществляем переход.
                                window.location.href = searchResult;
                            }
                            else {
                                // Скрываем анимацию.
                                loadingImg.style.display = 'none';
                                status.innerHTML = 'Ошибка отправки запроса.';
                                setTimeout(function() {status.innerHTML = '';}, 3000);
                                return false;
                            }
                        });
                    });
                });
            });
            return false;
        };
    }
}

// Вывод локальных заметок.
if (parameters.localNotes[2] === '1') {
    let pageTable = document.querySelector('#publisher_div table.basic tr[height="100%"] td[height="100%"]');
    if (pageTable) {
        let notesObj = JSON.parse(localStorage.notesObj || '{}'),
            notesBlock = document.createElement('div'),
            isEmpty = true,
            uuid = getParameterFromUrl('uuid');
        notesBlock.innerHTML = '<div>Список локальных заметок:</div>';
        notesBlock.style.background = '#fff';
        notesBlock.style.border = '1px solid #a9a9a9';
        notesBlock.style.margin = '2px';
        notesBlock.style.padding = '2px';

        for (let key in notesObj) {
            if (notesObj[key].textNote && notesObj[key].textNote !== '') {
                if (uuid === key) continue;
                isEmpty = false;
                let noteLink = document.createElement('a');
                noteLink.href = 'https://crm.o.westcall.spb.ru/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + key;
                noteLink.target = '_blank';
                noteLink.innerHTML = notesObj[key].textNote.substring(0, 180);
                noteLink.innerHTML += notesObj[key].textNote.length > 180 ? '...' : '';
                noteLink.style.display = 'block';
                notesBlock.appendChild(noteLink);
            }
        }
        if (isEmpty) notesBlock = document.createElement('div');
        pageTable.appendChild(notesBlock);

        if (uuid) getLocalNote(uuid, notesBlock);
    }
}

///////////////////////////////
///////////////////////////////
/////// Страница заявки ///////
///////////////////////////////
///////////////////////////////
expr = /uuid=corebo/;
// Определяем по location и наличию истории заявки.
if (expr.test(window.location.href) && document.getElementById('Deal.DealHistory')) {
    if (parameters.taskPreview[2] === '1') {
        var dealHistory = document.getElementById('Deal.DealHistory');
        if (dealHistory) {
            if (pageContent) {
                getTaskPreview(pageContent);
            }
        }
    }
}

////////////////////////////////////
////////////////////////////////////
/////// Страница контрагента ///////
////////////////////////////////////
////////////////////////////////////
expr = /uuid=corebo/;
// Определяем по location и наличию элемента статистики звонков.
if (expr.test(window.location.href) && document.querySelector('#callCount')) {
    if (parameters.responsibleDepartment[2] === '1') {
        // Добавляем ответственное подразделение к дополнительной информации.
        var reqService = document.querySelector('#Clients\\.ListsParent\\.ListsParent2\\.servicesList a[href*="uuid=crmsrv"]');
        if (reqService) {
            getFromUrl(reqService.href, true, function(response) {
                var responseDiv = document.createElement ('div');
                responseDiv.innerHTML = response;
                response = null;
                var servicePoint = responseDiv.querySelector('#Service\\.ListsParent\\.ListsParent2\\.PointsOfPresence a[href*="uuid=poppfx"]');
                if (servicePoint) {
                    getFromUrl(servicePoint.href, true, function(response) {
                        var responseDiv = document.createElement ('div');
                        responseDiv.innerHTML = response;
                        response = null;
                        var pointProvider = responseDiv.querySelector('#providerOU');
                        if (pointProvider) {
                            var otherStuff = document.querySelector('#otherStuff');
                            if (otherStuff.innerText === '') {
                                otherStuff.innerHTML = '(' + pointProvider.innerText.trim() + ')';
                            }
                            else otherStuff.innerHTML += '<br><br>(' + pointProvider.innerText.trim() + ')';
                        }
                    });
                }
            });
        }
    }
}

/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
/////// Страницы контрагента и электронного сообщения ///////
/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
expr = /uuid=(cemail|.*activeComponent=RequestsTAB)/;
// Определяем по location или наличию элемента статистики звонков.
if (document.querySelector('#callCount') || document.querySelector('#callCountUl') || expr.test(window.location.href)) {
    // Быстрый выбор типа обращения.
    if (parameters.quickRequest[2] === '1') {
        let addRequestLink = document.querySelector('a#ClientEmailTab\\.ClientEmailCard\\.addRequestFromEmailWizard');
        if (! addRequestLink) {
            addRequestLink = document.querySelector(
                'a#RequestsTAB\\.CRMRequestsList\\.CRMRequestsListActionContainer\\.ObjectListReport\\.tableListAndButtons\\.CRMRequestsList\\.addRequestWizard');
        }
        if (! addRequestLink) {
            addRequestLink = document.querySelector('a#Clients\\.addRequestWizard');
        }
        if (addRequestLink) {
            addRequestLink.addEventListener('mouseenter', function() {
                var mainColor = getComputedStyle(document.body).getPropertyValue('background-color');
                this.parentNode.style.paddingLeft = '5px';
                // Удаляем плавающий элемент с типами обращений.
                var quickRequestDiv = document.querySelector('#quickRequestDiv');
                if (quickRequestDiv) quickRequestDiv.remove();
                // Создаём плавающий элемент с типами обращений.
                quickRequestDiv = document.createElement ('div');
                quickRequestDiv.id = 'quickRequestDiv';
                quickRequestDiv.style.position = 'absolute';
                quickRequestDiv.style.zIndex = '1000';
                quickRequestDiv.style.marginLeft = 'calc(' + this.offsetLeft + 'px - 17px)';
                quickRequestDiv.style.maxHeight = '40vh';
                quickRequestDiv.style.minWidth = this.offsetWidth + 20;
                quickRequestDiv.style.maxWidth = '40vw';
                quickRequestDiv.style.overflow = 'auto';
                quickRequestDiv.style.wordWrap = 'break-word';
                quickRequestDiv.style.background = mainColor || '#ccc';
                quickRequestDiv.style.border = '2px solid #ccc';

                for (let type in requestTypes) {
                    if (type != '0') {
                        var quickRequestLink = this.cloneNode(true);
                        quickRequestLink.style.display = 'block';
                        quickRequestLink.style.margin = '1px';
                        quickRequestLink.style.padding = '3px';
                        quickRequestLink.style.fontSize = '8.5pt';
                        quickRequestLink.style.background = 'rgba(220,220,220,0.9)';
                        quickRequestLink.innerHTML = requestTypes[type];
                        quickRequestLink.href += '&RequestType=' + type;
                        quickRequestLink.setAttribute(
                            'onclick',
                            quickRequestLink.getAttribute('onclick')
                            .replace(/', 'form'/, '&RequestType=' + type + "', 'form'")
                        );
                        quickRequestDiv.appendChild(quickRequestLink);
                    }
                }

                this.parentNode.appendChild(quickRequestDiv);
            }, false);
            addRequestLink.parentNode.addEventListener("mouseleave", function() {
                var quickRequestDiv = document.querySelector('#quickRequestDiv');
                if (quickRequestDiv) quickRequestDiv.remove();
            }, false);
        }
    }
}
///////////////////////////////////////////////////////
///////////////////////////////////////////////////////
/////// Страница обращений на точке присутствия ///////
///////////////////////////////////////////////////////
///////////////////////////////////////////////////////
expr = /uuid=poppfx.*activeComponent=Requests/;
if (expr.test(window.location.href)) {
    // Быстрый выбор типа обращения.
    if (parameters.quickRequest[2] === '1') {
        let addRequestLink = document.querySelector('a#Requests\\.addRequestWizard');
        if (addRequestLink) {
            addRequestLink.addEventListener("mouseenter", function() {
                var mainColor = getComputedStyle(document.body).getPropertyValue('background-color');
                this.parentNode.style.paddingLeft = '5px';
                // Удаляем плавающий элемент с типами обращений.
                var quickRequestDiv = document.querySelector('#quickRequestDiv');
                if (quickRequestDiv) quickRequestDiv.remove();
                // Создаём плавающий элемент с типами обращений.
                quickRequestDiv = document.createElement ('div');
                quickRequestDiv.id = 'quickRequestDiv';
                quickRequestDiv.style.position = 'absolute';
                quickRequestDiv.style.zIndex = '1000';
                quickRequestDiv.style.marginLeft = 'calc(' + this.offsetLeft + 'px - 17px)';
                quickRequestDiv.style.maxHeight = '40vh';
                quickRequestDiv.style.minWidth = this.offsetWidth + 20;
                quickRequestDiv.style.maxWidth = '40vw';
                quickRequestDiv.style.overflow = 'auto';
                quickRequestDiv.style.wordWrap = 'break-word';
                quickRequestDiv.style.background = mainColor || '#ccc';
                quickRequestDiv.style.border = '2px solid #ccc';

                var pointRequestsTypes = {
                    accident_dds: 'Авария ДДС',
                    change_for_net: 'Изменения на сети',
                    x_otherSubjects: 'Общее'
                };

                for (let type in pointRequestsTypes) {
                    if (type != '0') {
                        var quickRequestLink = this.cloneNode(true);
                        quickRequestLink.style.display = 'block';
                        quickRequestLink.style.margin = '1px';
                        quickRequestLink.style.padding = '3px';
                        quickRequestLink.style.fontSize = '8.5pt';
                        quickRequestLink.style.background = 'rgba(220,220,220,0.9)';
                        quickRequestLink.innerHTML = pointRequestsTypes[type];
                        quickRequestLink.href += '&RequestType=' + type;
                        quickRequestLink.setAttribute('onclick',
                                                      quickRequestLink.getAttribute('onclick').replace(/', 'form'/, '&RequestType=' + type + "', 'form'"));
                        quickRequestDiv.appendChild(quickRequestLink);
                    }
                }

                this.parentNode.appendChild(quickRequestDiv);
            }, false);
            addRequestLink.parentNode.addEventListener("mouseleave", function() {
                // Удаляем плавающий элемент с типами обращений.
                var quickRequestDiv = document.querySelector('#quickRequestDiv');
                if (quickRequestDiv) quickRequestDiv.remove();
            }, false);
        }
    }
}

///////////////////////////////
///////////////////////////////
/////// Страница услуги ///////
///////////////////////////////
///////////////////////////////
expr = /uuid=crmsrv/;
if (expr.test(window.location.href)) {
    // Добавляем ответственное подразделение к адресу установки.
    if (parameters.responsibleDepartment[2] === '1') {
        var servicePoint = document.querySelector('#Service\\.ListsParent\\.ListsParent2\\.PointsOfPresence a[href*="uuid=poppfx"]');
        if (servicePoint) {
            getFromUrl(servicePoint.href, true, function(response) {
                var responseDiv = document.createElement ('div');
                responseDiv.innerHTML = response;
                response = null;
                var pointProvider = responseDiv.querySelector('#providerOU');
                if (pointProvider) {
                    document.querySelector('#installationAddressObject').innerHTML += '<br><br>(' + pointProvider.innerText.trim() + ')';
                }
            });
        }
    }

    // Возвращаем на место пароль и действующую ссылку для открытия ЛК.
    if (parameters.showAccountInfo[2] === '1') {
        var cabinetUrl = document.querySelector('#a_internetDDS_LK_FL');
        if (cabinetUrl) {
            try {
                // Получаем данные из скрытых полей.
                var cabinetLogin = document.querySelector('#form_internetDDS_LK_FL input[name="login"]').value;
                var cabinetPassword = document.querySelector('#form_internetDDS_LK_FL input[name="passwd"]').value;
                // Отключаем слушатель и возвращаем старую-добрую ссылку.
                cabinetUrl.onclick = function() {};
                cabinetUrl.href = 'https://crm/webdav/xfx/to_login_LK.html?lo=' + cabinetLogin + '&pa=' + cabinetPassword;
                cabinetUrl.target = '_blank';

                // Добавляем пароль в поле логина.
                let userNameCell = document.querySelector('#userName');
                if (cabinetLogin != 'null' && cabinetPassword != 'null') {
                    let userNameCaption = userNameCell.previousSibling;
                    if(userNameCaption && userNameCaption.innerHTML) {
                        userNameCaption.innerHTML = 'Логин/пароль';
                    }
                    else if(userNameCaption.previousSibling && userNameCaption.previousSibling.innerHTML) {
                        userNameCaption.previousSibling.innerHTML = 'Логин/пароль';
                    }
                    userNameCell.innerHTML = cabinetLogin + '/' + cabinetPassword;
                }
                else userNameCell.innerHTML = 'аккаунт не найден';
            }
            catch(error) {console.log('Unable to get hidden username and password' + error.name + '\n' + error.message + '\n' + error.stack);}
        }
    }
}

//////////////////////////////////
//////////////////////////////////
/////// Страница обращения ///////
//////////////////////////////////
//////////////////////////////////
expr = /uuid=crmreq/;
if (expr.test(window.location.href)) {
    let reqid = getParameterFromUrl('uuid'),
        histTable = document.getElementById('Request.RequestHistory');
    if (histTable) getLocalNote(reqid, histTable.parentNode);

    // Дополнительные ссылки на странице обращения.
    var linkHistory = document.getElementById('Request.RequestHistory.History');
    if (linkHistory) {
        if (parameters.taskPreview[2] === '1' && pageContent) {
            getTaskPreview(pageContent);
        }
        linkHistory.parentNode.scrollIntoView();
        // Получаем uuid обращения и создаём ссылку [выдать задачу] вручную.
        let addTask = document.createElement('span');
        addTask.innerHTML = ' <a onclick="open_in_new_window(window.event, \'/fx/$guic/ru.naumen.guic.components.forms.form_jsp?uuid=' + reqid +
            '&activeComponent=ProblemsTAB.CRMTasksList.CRMTasksListActionContainer.ObjectListReport.tableListAndButtons.CRMTasksList.AddCRMProblem\'' +
            ', \'form\', 330, 140); return false;" href="/fx/$guic/ru.naumen.guic.components.forms.form_jsp?uuid='+ reqid +
            '&activeComponent=ProblemsTAB.CRMTasksList.CRMTasksListActionContainer.ObjectListReport.tableListAndButtons.CRMTasksList.AddCRMProblem">[выдать задачу]</a> ';
        // Добавляем ссылку на верхнюю панель.
        var docTemplates = document.getElementById('Request.DocumentTemplates');
        if (docTemplates) docTemplates.parentNode.insertBefore(addTask, docTemplates);

        var historyToolbar = linkHistory.parentNode;
        // Копируем [сменить состояние] на нижнюю панель
        var setState = document.getElementById('Request.setState');
        if (setState) {
            historyToolbar.appendChild(setState.cloneNode(true));
            historyToolbar.innerHTML += ' ';
        }
        // Копируем [сменить ответственного] на нижнюю панель
        var setStageResponsible = document.getElementById('Request.setStageResponsible');
        if (setStageResponsible) {
            historyToolbar.appendChild(setStageResponsible.cloneNode(true));
            historyToolbar.innerHTML += ' ';
        }
        // Копируем [передать внутри отдела] на нижнюю панель
        var delegateToEmployee = document.getElementById('Request.delegateToEmployee');
        if (delegateToEmployee) {
            historyToolbar.appendChild(delegateToEmployee.cloneNode(true));
            historyToolbar.innerHTML += ' ';
        }
        // Копируем [выдать задачу] на нижнюю панель
        historyToolbar.appendChild(addTask.cloneNode(true), linkHistory);
        // Кнопка [добавить файл]
        let addTask1 = document.createElement('span');
        addTask1.innerHTML = ` <a id="Files.FilesList.AddFile"
        onclick="open_in_new_window(window.event, '/fx/$guic/ru.naumen.guic.components.forms.form_jsp?uuid=` + reqid +`&amp;activeComponent=Files.FilesList.AddFile', 'form', 330, 140); return false;"
        href="/fx/$guic/ru.naumen.guic.components.forms.form_jsp?uuid=` + reqid + `&amp;activeComponent=Files.FilesList.AddFile">[добавить файл]</a>`;
        historyToolbar.appendChild(addTask1.cloneNode(true), linkHistory);
    }

    // Добавляем ответственное подразделение.
    if (parameters.responsibleDepartment[2] === '1') {
        // Добавляем ответственное подразделение к списку услуг.
        let reqService = document.querySelector('#services a');
        if (reqService) {
            getFromUrl(reqService.href, true, function(response) {
                let responseDiv = document.createElement ('div');
                responseDiv.innerHTML = response;
                response = null;
                let servicePoint = responseDiv.querySelector('#Service\\.ListsParent\\.ListsParent2\\.PointsOfPresence a[href*="uuid=poppfx"]');
                if (servicePoint) {
                    getFromUrl(servicePoint.href, true, function(response) {
                        let responseDiv = document.createElement ('div');
                        responseDiv.innerHTML = response;
                        response = null;
                        let pointProvider = responseDiv.querySelector('#providerOU');
                        if (pointProvider) {
                            pointProvider = pointProvider.innerText.trim();
                            if (pointProvider !== '') {
                                document.querySelector('#services').innerHTML += '<br><br>(' + pointProvider + ')';
                            }
                        }
                    });
                }
            });
        }
        // Добавляем ответственное подразделение к точке присутствия.
        let servicePoint = document.querySelector('#requestSource a');
        if (servicePoint) {
            getFromUrl(servicePoint.href, true, function(response) {
                let responseDiv = document.createElement ('div');
                responseDiv.innerHTML = response;
                response = null;
                let pointProvider = responseDiv.querySelector('#providerOU');
                if (pointProvider) {
                    pointProvider = pointProvider.innerText.trim();
                    if (pointProvider !== '') {
                        document.querySelector('#requestSource').innerHTML += '<br><br>(' + pointProvider + ')';
                    }
                }
            });
        }
    }
}

///////////////////////////////////////////////////
///////////////////////////////////////////////////
/////// Страница полной истории обращения /////////
///////////////////////////////////////////////////
///////////////////////////////////////////////////
expr = /.*&activeComponent=History/;
if (expr.test(window.location.href)) {
    if (parameters.taskPreview[2] === '1' && pageContent) {
        getTaskPreview(pageContent);
    }
}

/////////////////////////////////
/////////////////////////////////
/////// Страница задачи /////////
/////////////////////////////////
/////////////////////////////////
expr = /uuid=crmtas/;
if (expr.test(window.location.href)) {
    let docTemplates = document.getElementById('CRMProblem.DocumentTemplates'),
        taskCopy = document.createElement('a');
    taskCopy.innerHTML = '[копировать]';
    taskCopy.title = 'Копировать';
    taskCopy.href = '';
    taskCopy.onclick = function(event) {
        copyTaskInfo(event, document.body);
    };
    if (docTemplates) docTemplates.parentNode.appendChild(taskCopy);
}

/////////////////////////////////
/////////////////////////////////
/////// Страница поиска /////////
/////////////////////////////////
/////////////////////////////////
expr = /&activeComponent=advSearchTab/;
// Скрытие заявок/услуг в результатах поиска.
if (expr.test(window.location.href)) {
    hideInSearchResults();
}

//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
/////// Страница дополнительных связей обращения /////////
//////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////
expr = /&activeComponent=ExtraBinds/;
if (expr.test(window.location.href)) {
    // Массовое удаление дополнительных связей.
    let bindTable = document.getElementById('ExtraBinds.RequestBoundServicesList');
    if (bindTable) {
        let addBindsLink = document.getElementById('ExtraBinds.bindServicesToRequestWizard'),
            remBindsLink = document.createElement('a'),
            targets = bindTable.innerHTML.match(/targetUUID=crmsrv\d+/g),
            reqId = getParameterFromUrl('uuid');

        remBindsLink.style.paddingLeft = '2px';
        remBindsLink.innerHTML = '[удалить связи с услугами]';
        remBindsLink.href = '';
        remBindsLink.onclick = function() {
            event.preventDefault();
            if (targets) {
                let isSure = window.confirm('Все дополнительные связи будут удалены.\nПродолжить?');
                if (targets) {
                    for (let i = 0; i < targets.length; i++) {
                        getFromUrl('/fx/$guic/ru.naumen.guic.components.lists.actionbuttoncolumnPressed_jsp?' + targets[i] +
                                    '&uuid=' + reqId + '&activeComponent=ExtraBinds.RequestBoundServicesList.Unbind', false)
                    }
                    location.reload();
                }
            }
            else alert('Нет дополнительных связей!');
            return false;
        }
        insertAfter(remBindsLink, addBindsLink);
    }
}

///////////////////////////////////////////////////
///////////////////////////////////////////////////
/////// Страница просмотра списка обращений ///////
///////////////////////////////////////////////////
///////////////////////////////////////////////////
expr = /activeComponent=RequestsTAB/;
if (expr.test(window.location.href)) {
    // Таблица обращений.
    var table = document.getElementById('RequestsTAB.CRMRequestsList.CRMRequestsListActionContainer.ObjectListReport.tableListAndButtons.CRMRequestsList');
    if (parameters.colorTable[2] === '1') {
        if (document.getElementById(`Request.RequestHistory`) != undefined){table = document.getElementById(`Request.RequestHistory`) }
        let table_row = table.rows;
        var table_status_col, table_desc_col, table_user_col;
        for (var i = 0; i<table_row.length; i++) {
            var table_cells = table_row[i].cells;
            if (i==0){
                for (let c in table_cells){
                    if ((table_cells[c].innerText == `Текущий статус`)||(table_cells[c].innerText == `Состояние обращения`)){table_status_col = c;}
                    if (table_cells[c].innerText == `Описание`){table_desc_col = c;}
                    if (table_cells[c].innerText == `Ответственный за состояние`){table_user_col = c;}
                }
            }
            //table_cells[table_desc_col].innerText = null;
            switch(table_cells[table_status_col].innerText){
                case "Запланирована дата обработки": table_cells[table_status_col].setAttribute("style", "background-color:#AD66D5");break;
                case "Запланирована дата обработки (снятие переадр)": table_cells[table_status_col].setAttribute("style", "background-color:#7D256F");break;
                case "Запланирована дата обработки (установка переадр)": table_cells[table_status_col].setAttribute("style", "background-color:#7D256F");break;
                case "ожидание действий клиента": table_cells[table_status_col].setAttribute("style", "background-color:#AD66D5");break;
                case "передано в работу (напр тех под В2В)": table_cells[table_status_col].setAttribute("style", "background-color:#FF7D73");break;
                case "отправлено в обработку": table_cells[table_status_col].setAttribute("style", "background-color:#FF7D73");break;
                case "принято в работу": table_cells[table_status_col].setAttribute("style", "background-color:#28a745");break;
                case "Авария": table_cells[table_status_col].setAttribute("style", "background-color: red");break;
                case "принято в обработку": table_cells[table_status_col].setAttribute("style", "background-color:#28a745");break;
            }

            //if (table_cells[table_user_col].innerText.startsWith(getUserName())){table_cells[table_user_col].setAttribute("style", "background-color:#28a745;");}
            //let user_id = parameters.username[2];
            //console.log (`${table_cells[table_user_col].innerHTML.indexOf(user_id)} != -1 - ${table_cells[table_user_col].innerHTML.indexOf(user_id) != -1}`)
            // console.log (table_cells[table_user_col].innerHTML.indexOf(user_id))
            if ((table_cells[table_user_col].innerHTML.indexOf(parameters.username[2]) != -1) && (parameters.colorUsername[2] == 1) ){table_cells[table_user_col].setAttribute("style", "background-color:#28a745;");}

        }
    }
    //console.log(table_status_col)
    if (table) {
        // Верхняя панель со ссылками.
        var panel = document.getElementById('RequestsTAB.CRMRequestsList.CRMRequestsListActionContainer' +
                                            '.ObjectListReport.tableListAndButtons.CRMRequestsList.massiveSetState').parentNode;
        // Берём идентификатор страницы.
        var uuid = getParameterFromUrl('uuid');
        // Отображение 200 обращений вместо 100.
        if (parameters.requestsPageExtend[2] === '1') {
            var pageSizeSelect = document.getElementById('pageSize');
            // Меняем текст на 200.
            if (table && pageSizeSelect) {
                pageSizeSelect.options[2].innerHTML = '200';
                if (pageSizeSelect.selectedIndex === 2) {
                    // Устанавливаем номер текущей страницы.
                    var curPageNum = getParameterFromUrl('crmrequestslist_pn', window.location.href);
                    if (! curPageNum) curPageNum = '0';
                    // Находим ссылку на следующую страницу
                    var nextPageLink = document.getElementById('RequestsTAB.CRMRequestsList.CRMRequestsListActionContainer.' +
                                                               'ObjectListReport.tableListAndButtons.CRMRequestsList_page' +
                                                               (parseInt(curPageNum, 10) + 2));
                    if (nextPageLink) {
                        // Обращаемся к следующей странице.
                        getFromUrl(nextPageLink.href, false, function(response) {
                            // Собираем временный элемент из полученного ответа.
                            var responseDiv = document.createElement ('div');
                            responseDiv.innerHTML = response;
                            response = null;
                            // Находим в нём нужную нам таблицу.
                            var nextTable = responseDiv.querySelector(
                                '#RequestsTAB\\.CRMRequestsList\\.CRMRequestsListActionContainer\\.ObjectListReport\\.tableListAndButtons\\.CRMRequestsList');
                            // Дополняем её строками основную таблицу.
                            for (let i = 1; i<nextTable.rows.length; i++) {
                                table.children[0].appendChild(nextTable.rows[i].cloneNode(true));
                            }
                            responseDiv = null;
                            nextTable = null;
                            // Убираем ненужную более ссылку на следующую страницу.
                            nextPageLink.remove();
                        });
                    }
                }
            }
        }

        // Счётчик обращений
        if (parameters.requestsCounter[2] === '1') {
            let personsTroubles = {},
                personsTroublesTop = {},
                personColumn = document.getElementById('RequestsTAB.CRMRequestsList.CRMRequestsListActionContainer.' +
                                                       'ObjectListReport.tableListAndButtons.CRMRequestsList.obj_stateResponsible_title' +
                                                       '.obj_stateResponsible_titleheaderCell');

            if (personColumn) {
                // Если колонка ответственного присутствует, собираем объект.
                for (let i = 1; i<table.rows.length; i++) {
                    let personCell = table.rows[i].cells[personColumn.cellIndex];
                    if (personCell) {
                        personCell = personCell.innerText.trim();
                        if (personCell === '') {
                            personCell = '<пусто>';
                        }
                        if (personsTroubles[personCell] === undefined) {
                            personsTroubles[personCell] = 1;
                        }
                        else personsTroubles[personCell] += 1;
                    }
                }

                // Сортируем имена по алфавиту.
                let namesSorted = Object.keys(personsTroubles).sort();
                if (namesSorted.length > 0) {
                    // Если объект что-то содержит, создаём поле счётчика.
                    let reqContainer = document.getElementById('ObjectListReport'),
                        personStat = document.createElement('textarea');
                    personStat.style.boxSizing = 'content-box';
                    personStat.style.resize = 'none';
                    personStat.style.margin = '0 2px';
                    personStat.style.display = 'block';
                    personStat.style.width = 'calc(100% - 8px)';
                    reqContainer.appendChild(personStat);

                    // Заполняем поле счётчика и объект топа по обращениям.
                    for (let i = 0; i < namesSorted.length; i++) {
                        let name = namesSorted[i];
                        personStat.value += name + ': ' + personsTroubles[name] + ';\n';
                        if (personsTroublesTop[personsTroubles[name]] === undefined) {
                            personsTroublesTop[personsTroubles[name]] = '';
                        }
                        personsTroublesTop[personsTroubles[name]] += name + '; ';
                    }

                    // Если в объекте больше одного ключа, выводим топ (сортируется сам по числовым ключам).
                    if (namesSorted.length > 1) {
                        for (let wcount in personsTroublesTop) {
                            personStat.value += '\n' + wcount + ': ' + personsTroublesTop[wcount];
                        }
                    }

                    // Подгоняем размер textarea под содержимое.
                    personStat.style.overflow = 'hidden';
                    //personStat.style.width = personStat.scrollWidth + 'px';
                    personStat.style.height = personStat.scrollHeight + 'px';
                    personStat.style.overflow = '';
                }
            }
        }

        // Массовая смена ответственного.
        if (parameters.requestsMassChange[2] === '1') {
            var allWorkers = getWorkers(uuid);
            if (Object.keys(allWorkers).length) {
                var setCap = document.createElement('span');
                setCap.innerHTML = 'Сменить ответственного: ';
                panel.appendChild(setCap);

                var select = document.createElement ('select');
                select.size = '1';
                //select.addEventListener ('click', function(){doSelect(this, false, true);}, false);
                for (let key in allWorkers) {
                    let option = document.createElement ('option');
                    option.value = key;
                    option.innerHTML = allWorkers[key];
                    select.appendChild(option);
                }
                panel.appendChild(select);

                var setButton = document.createElement('button');
                setButton.setAttribute('type', 'button');
                setButton.innerHTML = 'Передать';
                setButton.onclick = function() {
                    var checkRequests = table.querySelectorAll('input[name="selectedObjects"]'),
                        selRequests = [];
                    for (let i = 0; i < checkRequests.length; i++) {
                        if (checkRequests[i].checked) {
                            selRequests.push(checkRequests[i].value);
                        }
                    }

                    if (selRequests.length > 0) {
                        var respNew = select[select.selectedIndex].value,
                            isSure = window.confirm('Новый ответственный: ' + select[select.selectedIndex].innerHTML +
                                             '\nКоличество обращений: ' + selRequests.length + '\nПередать обращения?');
                        if (isSure) {
                            for (let i = 0; i < selRequests.length; i++) {
                                var urlBase = '/fx/$guic/ru.naumen.guic.components.forms.form_jsp?uuid='+ selRequests[i],
                                    urlCheck = urlBase + '&activeComponent=Request.setStageResponsible',
                                    urlDelegate = urlBase + '&activeComponent=Request.delegateToEmployee&target=' + respNew +
                                    '&first_load=false&__form_id=Request.delegateToEmployee&hidden_delegate=1&target__exists=1',
                                    urlSetResp = urlBase + '&activeComponent=Request.setStageResponsible&responsible=' + respNew +
                                    '&first_load=false&__form_id=Request.setStageResponsible&hidden_ok=1&responsible__exists=1';

                                getFromUrl(urlCheck, false, function(response) {
                                    expr = /check-permission\.css/;
                                    if (expr.test(response)) {
                                        getFromUrl(urlDelegate, false);
                                    }
                                    else {
                                        getFromUrl(urlSetResp, false);
                                    }
                                    response = null;
                                });
                            }
                            location.reload();
                        }
                    }
                    else window.alert('Не выбрано ни одного обращения!');
                };
                panel.appendChild(setButton);
            }
        }
    }
}

///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
/////// Страница просмотра списка обращений (включая точки присутствия) ///////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
expr = /activeComponent=Requests(TAB)?/;
if (expr.test(window.location.href)) {
    // Таблица обращений.
    let table = document.getElementById('RequestsTAB.CRMRequestsList.CRMRequestsListActionContainer.ObjectListReport.tableListAndButtons.CRMRequestsList') ||
        document.getElementById('Requests.CRMRequestsList.CRMRequestsListActionContainer.ObjectListReport.tableListAndButtons.CRMRequestsList');
    // Верхняя панель со ссылками.
    let panel = document.getElementById('RequestsTAB.CRMRequestsList.CRMRequestsListActionContainer' +
                                        '.ObjectListReport.tableListAndButtons.CRMRequestsList.massiveSetState') ||
        document.getElementById('Requests.CRMRequestsList.CRMRequestsListActionContainer' +
                                '.ObjectListReport.tableListAndButtons.CRMRequestsList.massiveSetState');
    if (panel) panel = panel.parentNode;

    if (table) {
        // Берём идентификатор страницы.
        let uuid = getParameterFromUrl('uuid');

        // Обратный отсчёт обновления страницы обращений.
        if (parameters.refreshCountdown[2] === '1') {
            var refreshInterval = document.querySelector('#RequestsTAB\\.CRMRequestsList\\.CRMRequestsListActionContainer' +
                                                         '\\.ObjectListReport\\.layout\\.refreshMinutes div[style] b') ||
                document.querySelector('#Requests\\.CRMRequestsList\\.CRMRequestsListActionContainer\\.ObjectListReport' +
                                       '\\.layout\\.refreshMinutes div[style] b');
            if (refreshInterval) {
                var refreshMinutes = parseInt(refreshInterval.innerText, 10);
                var refreshSeconds = refreshMinutes * 60;
                if (refreshSeconds !== 0) {
                    setInterval(function() {
                        refreshSeconds--;
                        var remainingMinutes = Math.floor(refreshSeconds/60);
                        var remainingSeconds = refreshSeconds - remainingMinutes * 60;
                        remainingSeconds = remainingSeconds > 9 ? remainingSeconds : '0' + remainingSeconds;
                        refreshInterval.innerHTML = refreshMinutes + ' (' + remainingMinutes + ':' + remainingSeconds + ')';
                    }, 1000);
                }
            }
        }

        // Фильтр строк таблицы.
        if (parameters.requestFilter[2] === '1') {
            // Поле фильтра.
            var filterInput = document.createElement('input');
            filterInput.setAttribute('style', 'min-height: 21px; margin:0 5px; padding:2px;');
            filterInput.placeholder = 'Фильтр строк';
            filterInput.value = localStorage['filterString_' + uuid] || '';
            panel.appendChild(filterInput);
            // Счётчик фильтрации.
            var filterCounter = document.createElement('span');
            panel.appendChild(filterCounter);

            // Чекбокс выбора всех строк.
            var checkboxAll = document.body.querySelector('input[name=selectedObjects_header]');

            filterInput.oninput = function() {
				        // Сохраняем текущий фильтр в localStorage.
				        localStorage['filterString_' + uuid] = this.value;

                if (this.value !== '') {
                    // Блокируем чекбокс.
                    if (checkboxAll) {
                        checkboxAll.style.display = 'none';
                    }

                    // Отображаем только те строки, где найдены слова из запроса, ведя их подсчёт.
                    var visibleCounter = 0;
                    for (let i = 1; i<table.rows.length; i++) {
                        var row = table.rows[i];
                        if (searchKeywords(row.textContent, this.value)) {
                            row.style.display = '';
                            visibleCounter++;
                        }
                        else {
                            row.style.display = 'none';
                        }
                    }
                    filterCounter.innerHTML = visibleCounter + ' / ' + (table.rows.length-1);
                }
                else {
                    // Снимаем блокировку чекбокса.
                    if (checkboxAll) {
                        checkboxAll.style.display = '';
                    }

                    // Делаем все строки видимыми.
                    for (let v = 1; v<table.rows.length; v++) {
                        table.rows[v].style.display = '';
                    }
                    filterCounter.innerHTML = (table.rows.length-1) + ' / ' + (table.rows.length-1);
                }

                // Возвращаем чередование цвета строк.
                var light = true;
                for (let r = 1; r<table.rows.length; r++) {
                    if (table.rows[r].style.display != 'none') {
                        if (light) {
                            table.rows[r].className = 'light';
                            light = false;
                        }
                        else {
                            table.rows[r].className = 'dark';
                            light = true;
                        }
                    }
                }
            };

            // Производим фильтрацию при запуске.
            if (localStorage['filterString_' + uuid]) {
                filterInput.oninput();
            }
        }

        // Предпросмотр списка обращений (фиксированная панель).
        // Объект с кэшем предпросмотра.
        var reqInfoArr = {},
            prevFrame, prevRefresh, prevPlaceholder, prevContent, prevLinks, prevHist;
        if (parameters.requestPreview[2] === '1') {
            // Вычисляем габариты и положение для панели предпросмотра.
            let prevWidth = '100%',
                elemRect, bodyRect, offsetL, offsetR;
            if (getComputedStyle(document.getElementById('nav_td')).getPropertyValue('position') == 'fixed') {
                elemRect = document.getElementById('publisher_div').getBoundingClientRect();
                bodyRect = document.body.getBoundingClientRect();
                offsetL = elemRect.left;
                offsetR = bodyRect.right - elemRect.right;
                prevWidth = 'calc(100% - ' + (offsetL + offsetR) + 'px)';
            }

            // Подбираем цвет для панели.
            let mainColor = getComputedStyle(document.body).getPropertyValue('background-color');

            // Создаём элементы, задавая стили и свойства.
            prevFrame = document.createElement('div');
            prevFrame.style.background = mainColor || '#ccc';
            prevFrame.style.zIndex = '1002';
            prevFrame.style.position = 'fixed';
            prevFrame.style.bottom = '0px';
            prevFrame.style.left = offsetL;
            // Читаем параметр, сохранённый ранее в localStorage.
            prevFrame.style.height = sessionStorage['prevFrame_' + uuid] || '180px';
            prevFrame.style.maxHeight = localStorage.hidePrevFame == 'true' ? '50px' : '90vh';
            prevFrame.style.width = prevWidth;
            document.body.style.paddingBottom = prevFrame.style.height;
            document.body.appendChild(prevFrame);
            resizer(prevFrame, 'prevFrame_' + uuid);

            var prevHideCheckbox = document.createElement('input');
            prevHideCheckbox.style.verticalAlign = 'sub';
            prevHideCheckbox.type = 'checkbox';
            prevHideCheckbox.id = 'hidePrevFame';
            prevHideCheckbox.checked = localStorage.hidePrevFame == 'true' ? true : false;
            prevHideCheckbox.onchange = function() {
				        localStorage.hidePrevFame = prevHideCheckbox.checked;
            };
            var prevHideCheckLabel = document.createElement('label');
            prevHideCheckLabel.style.position = 'absolute';
            prevHideCheckLabel.style.top = '8px';
            prevHideCheckLabel.style.right = '3px';
            prevHideCheckLabel.innerHTML = 'Автоскрытие';
            prevHideCheckLabel.appendChild(prevHideCheckbox);
            prevFrame.appendChild(prevHideCheckLabel);

            prevRefresh = document.createElement('a');
            prevRefresh.style.position = 'absolute';
            prevRefresh.style.display = 'none';
            prevRefresh.style.top = '25px';
            prevRefresh.style.right = '7px';
            prevRefresh.innerHTML = '[обновить]';
            prevRefresh.href = '';
            prevFrame.appendChild(prevRefresh);

            var prevCopyUrl = document.createElement('a');
            prevCopyUrl.style.position = 'absolute';
            prevCopyUrl.style.display = 'none';
            prevCopyUrl.style.top = '40px';
            prevCopyUrl.style.right = '7px';
            prevCopyUrl.innerHTML = '[ссылка]';
            prevFrame.appendChild(prevCopyUrl);

            prevPlaceholder = document.createElement('div');
            prevPlaceholder.style.background = 'rgba(220,220,220,0.7)';
            prevPlaceholder.style.textAlign = 'center';
            prevPlaceholder.innerHTML = '<b>Нажмите на любое обращение для предварительного просмотра.</b>';
            prevFrame.appendChild(prevPlaceholder);

            prevContent = document.createElement('div');
            prevContent.style.background = 'rgba(220,220,220,0.7)';
            prevContent.style.height = 'calc(100% - 6px)';
            prevContent.style.padding = '5px';
            prevContent.style.boxSizing = 'border-box';
            prevFrame.appendChild(prevContent);

            prevLinks = document.createElement('div');
            prevLinks.style.height = '70px';
            prevLinks.style.marginRight = '95px';
            prevLinks.style.overflowX = 'hidden';
            prevLinks.style.whiteSpace = 'nowrap';
            prevContent.appendChild(prevLinks);

            prevHist = document.createElement('div');
            prevHist.style.maxHeight = 'calc(100% - 70px)';
            prevHist.style.overflow = 'auto';
            prevHist.style.id = 'prevHistDiv';
            prevContent.appendChild(prevHist);

            // Загружаем ранее просматриваемое обращение, если такое найдено в localStorage.
            let reqid = sessionStorage['prevReqId_' + uuid];
            if (reqid) {
                // Отображаем элементы копирования ссылки и обновления.
                prevCopyUrl.style.display = '';
                prevCopyUrl.href = 'https://' + window.location.hostname + '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + reqid;
                prevRefresh.style.display = '';
                // Загружаем данные предпросмотра.
                getReqPreview(reqid);
            }
            else {
                prevFrame.style.height = '50px';
            }

            // Объект с кэшем предпросмотра.
            reqInfoArr = {};
            // Идём по строкам таблицы.
            for (let i = 1; i<table.rows.length; i++) {
                // Если находим строку выбранного ранее обращения, выделяем её бордюром.
                if (table.rows[i].children[0].children[0].value == reqid) {
                    table.rows[i].style.border = '2px solid #999';
                }
                else table.rows[i].style.border = '';

                // Вешаем слушатель на строки.
                table.rows[i].addEventListener('click', function(event){
                    prevFrame.style.maxHeight = '90vh';
                    prevFrame.style.height = sessionStorage['prevFrame_' + uuid] || '180px';
                    // Получаем ID обращения, записываем его в localStorage.
                    var reqid = this.children[0].children[0].value;
					          sessionStorage['prevReqId_' + uuid] = reqid;
                    // Отображаем элементы копирования ссылки и обновления.
                    prevCopyUrl.href = 'https://' + window.location.hostname + '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + reqid;
                    prevCopyUrl.style.display = '';
                    prevRefresh.style.display = '';

                    // Если данные есть в кэше, отображаем их из него или запрашиваем с других страниц функцией.
                    if (reqInfoArr[reqid + '_links'] && reqInfoArr[reqid + '_history']) {
                        prevPlaceholder.style.display = 'none';
                        prevLinks.innerHTML = '<div>' + reqInfoArr[reqid + '_links'].innerHTML + '</div>';
                        prevHist.innerHTML = '<div>' + reqInfoArr[reqid + '_history'].innerHTML + '</div>';

                        // Делаем ссылки и номера кликабельными.
                        if (parameters.clickableLinks[2] === '1') {
                            modifyTextNodes(prevLinks);
                            modifyTextNodes(prevHist);
                        }
                        // Получаем заметку по обращению.
                        getLocalNote(reqid, prevHist.children[0]);
                        // Получаем предпросмотр обращений.
                        if (parameters.taskPreview[2] === '1') {
                            getTaskPreview(prevHist);
                        }
                    }
                    else getReqPreview(reqid);

                    // Убираем бордюры у всех строк, ставим бордюр на текущую.
                    for (let j = 1; j<table.rows.length; j++) {
                        table.rows[j].style.border = '';
                    }
                    this.style.border = '2px solid #999';

                    event.stopPropagation(); // Препятствуем распространению события на родительские элементы.
                }, false);
            }

            // Препятствуем прокрутке родителя, при прокрутке истории обращения.
            prevHist.onwheel = function(event) {
                var delta = event.deltaY || event.detail || event.wheelDelta;

                if (delta < 0 && this.scrollTop === 0) {
                    event.preventDefault();
                }
                if (delta > 0 && this.scrollHeight - this.clientHeight - this.scrollTop <= 1) {
                    event.preventDefault();
                }
            };

            // Автоскрытие панели предпросмотра.
            prevFrame.addEventListener('mouseenter', function(event){
                if (localStorage.hidePrevFame == 'true') {
                    prevFrame.style.maxHeight = '90vh';
                    prevFrame.parentElement.style.paddingBottom = prevFrame.style.height;
                }
            }, false);
            prevFrame.addEventListener('mouseleave', function(event){
                if (localStorage.hidePrevFame == 'true' && event.buttons != 1) {
                    prevFrame.style.maxHeight = '50px';
                    prevFrame.parentElement.style.paddingBottom = '50px';
                }
            }, false);

            // Обновление текущего трабла.
            prevRefresh.addEventListener('click', function(event){
                getReqPreview(sessionStorage['prevReqId_' + uuid]);
                event.preventDefault();
                return false;
            }, false);
            // Копирование ссылки текущего трабла.
            prevCopyUrl.addEventListener('click', function(event) {
                copyText('Ссылка обращения:',
                         'https://' + window.location.hostname + '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + sessionStorage['prevReqId_' + uuid], event);
                event.preventDefault();
                return false;
            }, false);
        }
        else if (parameters.requestPreview[2] === '2') {
            // Предпросмотр списка обращений (всплывающая панель).
            for (let i = 1; i<table.rows.length; i++) {
                // При наведении на первую ячейку строки с обращением.
                table.rows[i].children[0].addEventListener('mouseenter', function() {
                    if (! this.children[1]) {
                        var mainColor = getComputedStyle(document.body).getPropertyValue('background-color');
                        var reqid = this.children[0].value;

                        try {prevFrame.remove();}
                        catch(error) {}
                        // Создаём плавающий элемент предпросмотра.
                        prevFrame = document.createElement ('div');
                        prevFrame.style.position = 'absolute';
                        prevFrame.style.marginLeft = '16px';
                        prevFrame.style.marginTop = '';
                        prevFrame.style.padding = '2px';
                        prevFrame.style.minWidth = '300px';
                        prevFrame.style.maxWidth = this.parentNode.offsetWidth - 50;
                        prevFrame.style.maxHeight = '40vh';
                        prevFrame.style.overflow = 'auto';
                        prevFrame.style.wordWrap = 'break-word';
                        prevFrame.style.background = mainColor || '#ccc';
                        prevFrame.style.border = '1px solid #888';
                        //prevFrame.addEventListener("mouseleave", function() {this.remove();}, false);
                        this.appendChild(prevFrame);

                        // Обновление текущего трабла.
                        prevRefresh = document.createElement('a');
                        prevRefresh.style.position = 'absolute';
                        prevRefresh.style.top = '7px';
                        prevRefresh.style.right = '7px';
                        prevRefresh.innerHTML = '[обновить]';
                        prevRefresh.href = '';
                        prevRefresh.addEventListener('click', function(event) {
                            getReqPreview(reqid);
                            event.preventDefault();
                            return false;
                        }, false);
                        prevFrame.appendChild(prevRefresh);

                        // Копирование ссылки текущего трабла.
                        prevCopyUrl = document.createElement('a');
                        prevCopyUrl.style.position = 'absolute';
                        prevCopyUrl.style.top = '25px';
                        prevCopyUrl.style.right = '7px';
                        prevCopyUrl.innerHTML = '[ссылка]';
                        prevCopyUrl.href = 'https://' + window.location.hostname + '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + reqid;
                        prevCopyUrl.title = 'Копировать';
                        prevCopyUrl.addEventListener('click', function(event) {
                            copyText('Ссылка обращения:', 'https://' + window.location.hostname + '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + reqid, event);
                            event.preventDefault();
                            return false;
                        }, false);
                        prevFrame.appendChild(prevCopyUrl);

                        prevPlaceholder = document.createElement ('div');
                        prevPlaceholder.style.background = 'rgba(220,220,220,0.7)';
                        prevPlaceholder.style.textAlign = 'center';
                        prevFrame.appendChild(prevPlaceholder);

                        prevContent = document.createElement('div');
                        prevContent.style.background = 'rgba(220,220,220,0.7)';
                        prevContent.style.height = '100%';
                        prevContent.style.padding = '5px';
                        prevContent.style.boxSizing = 'border-box';
                        prevFrame.appendChild(prevContent);

                        prevLinks = document.createElement('div');
                        prevLinks.style.height = '70px';
                        prevLinks.style.marginRight = '75px';
                        prevLinks.style.overflowX = 'hidden';
                        prevLinks.style.whiteSpace = 'nowrap';
                        prevContent.appendChild(prevLinks);

                        prevHist = document.createElement('div');
                        prevHist.style.maxHeight = 'calc(100% - 70px)';
                        prevHist.style.overflow = 'auto';
                        prevHist.style.id = 'prevHistDiv';
                        prevContent.appendChild(prevHist);

                        // Препятствуем прокрутке родителя, при прокрутке истории обращения.
                        prevFrame.onwheel = function(event) {
                            var delta = event.deltaY || event.detail || event.wheelDelta;

                            if (delta < 0 && this.scrollTop === 0) {
                                event.preventDefault();
                            }
                            if (delta > 0 && this.scrollHeight - this.clientHeight - this.scrollTop <= 1) {
                                event.preventDefault();
                            }
                        };

                        // Если данные есть в кэше, отображаем их из него или запрашиваем с других страниц функцией.
                        if (reqInfoArr[reqid + '_links'] && reqInfoArr[reqid + '_history']) {
                            prevPlaceholder.style.display = 'none';
                            prevLinks.innerHTML = '<div>' + reqInfoArr[reqid + '_links'].innerHTML + '</div>';
                            prevHist.innerHTML = '<div>' + reqInfoArr[reqid + '_history'].innerHTML + '</div>';
                            // Делаем ссылки и номера кликабельными.
                            if (parameters.clickableLinks[2] === '1') {
                                modifyTextNodes(prevHist);
                            }
                            // Получаем предпросмотр задач.
                            if (parameters.taskPreview[2] === '1') {
                                getTaskPreview(prevHist);
                            }
                            // Получаем заметку по обращению.
                            getLocalNote(reqid, prevHist.children[0]);
                            // При предпросмотре в плавающем элементе, если он не помещается в видимую часть страницы, поднимаем вверх на собственную высоту.
                            if (parameters.requestPreview[2] === '2' && !elementInViewport(prevFrame)) {
                                prevFrame.style.marginTop = '-' + prevFrame.offsetHeight;
                            }
                        }
                        else getReqPreview(reqid);
                    }
                }, false);
                // При уходе со строки с обращением.
                table.rows[i].addEventListener('mouseleave', function() {
                    // Удаляем элемент предпросмотра.
                    var prevFrameDelete = this.children[0].children[1];
                    if (prevFrameDelete) {
                        prevFrameDelete.remove();
                    }
                }, false);
            }
        }
    }
}

///////////////////////////////////////////
///////////////////////////////////////////
/////// Окно добавления комментария ///////
///////////////////////////////////////////
///////////////////////////////////////////
expr = /\.AddCRMComment/;
if (expr.test(window.location.href)) {
    var textarea = document.querySelector('#text');
    var notificationBlock = document.querySelector('#notificationRecepients_outer');
    if (textarea) {
        if (parameters.hideNotifyBlock[2] === '1' && notificationBlock) {
            // Убираем по умолчанию поле установки оповещения.
            notificationBlock.style.display = 'none';
            var notificationButton = document.createElement ('button');
            notificationButton.setAttribute('type', 'button');
            notificationButton.style.margin = '4px 0px';
            notificationButton.innerHTML = 'Список оповещаемых [+]';
            notificationButton.title = 'Отображение/скрытие блока установки оповещения';
            notificationButton.onclick = function(){
                if (notificationBlock.style.display == 'none') {
                    this.innerHTML = 'Список оповещаемых [-]';
                    notificationBlock.style.display = '';
                }
                else {
                    this.innerHTML = 'Список оповещаемых [+]';
                    notificationBlock.style.display = 'none';
                }
            };
            textarea.parentNode.insertBefore(notificationButton, null);
        }

        if (parameters.filterNotifyBlock[2] === '1' && notificationBlock) {
            // Альтернативный фильтр полей оповещаемых.
            let filter = notificationBlock.querySelector('input[onkeyup]'),
                select = notificationBlock.querySelector('#notificationRecepients_left');
            if (filter) {
                let resultNumbers = [],
                    currentResultInd;
                filter.onkeyup = function() {
                    let options = select.querySelectorAll('option');
                    resultNumbers = [];
                    currentResultInd = null;
                    for (let i = 0; i < options.length; i++) {
                        if (searchKeywords(options[i].textContent, this.value)) {
                            resultNumbers.push(i);
                        }
                    }
                    //console.log(resultNumbers);

                    if (resultNumbers.length > 0) {
                        currentResultInd = 0;
                        if (! options[resultNumbers[currentResultInd]].disabled) {
                            select.selectedIndex = resultNumbers[currentResultInd];
                        }
                        options[resultNumbers[currentResultInd]].scrollIntoView();
                    }
                }

                let previousResult = document.createElement('button'),
                    nextResult = document.createElement('button');
                previousResult.type = 'button';
                nextResult.type = 'button';
                previousResult.innerHTML = '˄';
                nextResult.innerHTML = '˅';
                previousResult.onclick = nextResult.onclick = function() {
                    let options = select.querySelectorAll('option');
                    if (resultNumbers.length > 1) {
                        if (this.innerHTML === '˄' && currentResultInd > 0) {
                            currentResultInd--;
                        }
                        if (this.innerHTML === '˅' && currentResultInd < resultNumbers.length - 1) {
                            currentResultInd++;
                        }
                        if (! options[resultNumbers[currentResultInd]].disabled) {
                            select.selectedIndex = resultNumbers[currentResultInd];
                        }
                        options[resultNumbers[currentResultInd]].scrollIntoView();
                    }
                }
                insertAfter(nextResult, filter);
                insertAfter(previousResult, filter);
            }
        }

        // Если комментарий к обращению, добавляем полный редактор, включая теги.
        expr = /Request\.RequestHistory\.AddCRMComment/;
        if (expr.test(window.location.href)) {
            doEditor(textarea, answerTemplates.addCommentTemplate[1].split('\n'));
        }
        // Или редактов без тегов.
        else {
            doEditor(textarea, answerTemplates.addCommentTemplate[1].split('\n'), true);
        }
    }
}

/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////
/////// Окно регистрации обращения (контрагент, список обращений на нём и электронные письма) ///////
/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////
expr = /activeComponent=((Clients\.|.*CRMRequestsList.*)addRequestWizard|ClientEmailTab\.ClientEmailCard\.addRequestFromEmailWizard)/;
if (expr.test(window.location.href)) {
    // Редактор в окне регистрации обращения.
    let textarea = document.querySelector('#requestDescription');

    if (textarea) {
        doEditor(textarea, answerTemplates.regRequestClientTemplate[1].split('\n'));
    }

    var sel = document.getElementById('BOCase');

    // Автозаполнение окна регистрации обращения.
    if (parameters.regRequestAutofill[2] === '1') {
        // TODO: To params?
        var caseGroupUL = document.querySelector('#requestCaseGroup[value="pstcimfs000080000ke51enh66s277p4"]'); // Группа "Обращения по ЮЛ".

        // Если не выбрана ни одна из групп и есть "Обращения по ЮЛ".
        if (! document.querySelector('#requestCaseGroup:checked') && caseGroupUL) {
            caseGroupUL.checked = true;
            window.document.getElementById('refresh').click();
            throw 'reload';
        }
        else if (sel && sel.selectedIndex === 0) {
            var requestType = getParameterFromUrl('RequestType');
            if (requestType) {
                changeSel(requestType, sel.id, true);
            }
            else if (parameters.defaultRequestType[2] != '0') {
                changeSel(parameters.defaultRequestType[2], sel.id, true);
            }
        }

        var services = document.getElementById('services');
        if (services && services.options.length == 1) services.selectedIndex = 0;

        var type = document.getElementById('Category_SD_other');
        if (type) type.checked = true;

        var nextCall = document.querySelector('#nextCallDate_outer img[src="$guic/images/current_time.gif"]');
        if (nextCall) nextCall.click();

        // Подстановка дилера ДДС на территории.
        let dealerPhis = document.querySelector('#dealerPhis');
        if (dealerPhis) {
            let clientUrl = '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + getParameterFromUrl('uuid');
            getFromUrl(clientUrl, true, function(response) {
                var responseDiv = document.createElement ('div');
                responseDiv.innerHTML = response;
                response = null;
                var reqService = responseDiv.querySelector('#Clients\\.ListsParent\\.ListsParent2\\.servicesList a[href*="uuid=crmsrv"]');
                if (reqService) {
                    getFromUrl(reqService.href, true, function(response) {
                        var responseDiv = document.createElement ('div');
                        responseDiv.innerHTML = response;
                        response = null;
                        var servicePoint = responseDiv.querySelector('#Service\\.ListsParent\\.ListsParent2\\.PointsOfPresence a[href*="uuid=poppfx"]');
                        if (servicePoint) {
                            getFromUrl(servicePoint.href, true, function(response) {
                                var responseDiv = document.createElement ('div');
                                responseDiv.innerHTML = response;
                                response = null;
                                var pointProvider = responseDiv.querySelector('#dealerPhis a');
                                if (pointProvider) {
                                    console.log(pointProvider.innerText.trim());
                                    let option = document.createElement('option');
                                    option.innerHTML = pointProvider.innerText.trim();
                                    option.value = getParameterFromUrl('uuid', pointProvider.href);
                                    dealerPhis.insertBefore(option, dealerPhis.children[0]);
                                    dealerPhis.selectedIndex = 0;
                                }
                            });
                        }
                    });
                }
            });
        }
    }

    // Полноразмерный Select по клику.
    if (sel && parameters.fullsizeSelects[2] === '1') {
        sel.addEventListener('click', function(){doSelect(this);}, false);
    }
}

//////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////
/////// Окно регистрации обращения (точки присутствия) ///////
//////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////
expr = /uuid=poppfx.*activeComponent=Requests\.addRequestWizard/;
if (expr.test(window.location.href)) {
    // Редактор в окне регистрации обращения.
    let textarea = document.querySelector('#requestDescription');

    if (textarea) {
        doEditor(textarea, answerTemplates.regRequestPointTemplate[1].split('\n'));
    }

    let sel = document.getElementById('BOCase');

    if (parameters.regRequestAutofill[2] === '1') {
        // Автозаполнение окна регистрации обращения.
        // TODO: To params?
        let caseGroupUL = document.querySelector('#requestCaseGroup[value="pstcimfs000080000ke51enh66s277p4"]'), // Группа "Обращения по ЮЛ".
            caseGroupSrv = document.querySelector('#requestCaseGroup[value="pstcimfs000080000ke51fbe0o4snksg"]'), // Группа "Служебные обращения".
            requestType = getParameterFromUrl('RequestType');

        // Проверяем не выбрана ли какая-либо из групп.
        if (! document.querySelector('#requestCaseGroup:checked')) {
            if (requestType == 'change_for_net' && caseGroupSrv) {
                caseGroupSrv.checked = true;
                window.document.getElementById('refresh').click();
                throw 'reload';
            }
            else if (caseGroupUL) {
                caseGroupUL.checked = true;
                window.document.getElementById('refresh').click();
                throw 'reload';
            }
        }
        else if (sel && sel.selectedIndex === 0) {
            if (requestType) {
                changeSel(requestType, sel.id, true);
            }
            else if (parameters.defaultRequestType[2] != '0') {
                changeSel('accident_dds', sel.id, true);
            }
        }
    }

    // Полноразмерный Select по клику.
    if (sel && parameters.fullsizeSelects[2] === '1') {
        sel.addEventListener('click', function(){doSelect(this);}, false);
    }
}

//////////////////////////////////////////////
//////////////////////////////////////////////
/////// Окно смены состояния обращения ///////
//////////////////////////////////////////////
//////////////////////////////////////////////
expr = /activeComponent=Request\.setState/;
if (expr.test(window.location.href)) {
    // Редактор в окне смены состояния обращения.
    let textarea = document.querySelector('#detailedCause');

    if (textarea) {
        doEditor(textarea, answerTemplates.setStateTemplate[1].split('\n'));
    }

    // Работа с переключателем состояния обращения.
    let sel = document.getElementById('state'),
        options = sel.options;

    // Выбираем по умолчанию сосояние "Закрыто".
    var firstLoad = document.querySelector('input[name="first_load"]');
    if (options[sel.selectedIndex].value != 'wstage180580g0000i74rd6s9lfqfoq8') {
        if (firstLoad.value == 'true') {
            changeSel('wstage180580g0000i74rd6s9lfqfoq8', sel.id, true);
        }
    }

    // Кнопки состояний вместо Select.
    for (let i = 0; i < options.length; i++) {
        var stateButton = document.createElement ('button');
        stateButton.id = options[i].value;
        stateButton.innerHTML = options[i].text;
        if (sel.selectedIndex == i) stateButton.innerHTML = '<b>' + options[i].text + '</b>';
        stateButton.setAttribute('type', 'button');
        stateButton.onclick = function() {changeSel(this.id, 'state', true);};
        sel.parentNode.insertBefore(stateButton, sel);
    }
    sel.style.display = 'none';

    // Автозаполнение окна смены состояния.
    fillInputs();
    var qualForm = document.getElementById('paydopwork_outer');
    if (qualForm) {
        var fillButton = document.createElement ('button');
        var clearButton = document.createElement ('button');
        fillButton.innerHTML = 'Заполнить анкету';
        clearButton.innerHTML = 'Очистить анкету';
        fillButton.setAttribute('type', 'button');
        clearButton.setAttribute('type', 'button');
        fillButton.onclick = function() {fillInputs(true);};
        clearButton.onclick = function() {clearInputs();};
        qualForm.children[1].insertBefore(fillButton, qualForm.children[1].children[0]);
        qualForm.children[1].insertBefore(clearButton, qualForm.children[1].children[1]);
    }

    // Установка ответственных подразделений.
    var resSel = document.getElementById('Responsible');
    if (resSel) {
        for (let res in responsibles) {
            if (responsibles[res] == 'break') {
                resSel.parentNode.insertBefore(document.createElement('br'), resSel);
            }
            else {
                var button = document.createElement('button');
                button.id = res;
                button.innerHTML = responsibles[res][0];
                button.title = responsibles[res][1];
                button.setAttribute('type', 'button');
                button.onclick = function() {changeSel(this.id, 'Responsible', false);};
                resSel.parentNode.insertBefore(button, resSel);
                let option = document.createElement('option');
                option.innerHTML = responsibles[res][1];
                option.value = res;
                resSel.appendChild(option);
            }
        }
        resSel.parentNode.insertBefore(document.createElement('br'), resSel);

        // Добавляем ответственное подразделение слева от выбора.
        if (parameters.responsibleDepartment[2] === '1') {
            var responsibleOuter = document.querySelector('#Responsible_outer');
            if (responsibleOuter) {
                var reqUrl = '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + getParameterFromUrl('uuid');
                getFromUrl(reqUrl, true, function(response) {
                    var responseDiv = document.createElement ('div');
                    responseDiv.innerHTML = response;
                    response = null;
                    // Список услуг обращения.
                    var reqService = responseDiv.querySelector('#services a');
                    if (reqService) {
                        getFromUrl(reqService.href, true, function(response) {
                            var responseDiv = document.createElement ('div');
                            responseDiv.innerHTML = response;
                            response = null;
                            var servicePoint = responseDiv.querySelector('#Service\\.ListsParent\\.ListsParent2\\.PointsOfPresence a[href*="uuid=poppfx"]');
                            if (servicePoint) {
                                getFromUrl(servicePoint.href, true, function(response) {
                                    var responseDiv = document.createElement ('div');
                                    responseDiv.innerHTML = response;
                                    response = null;
                                    var pointProvider = responseDiv.querySelector('#providerOU');
                                    if (pointProvider) {
                                        responsibleOuter.children[0].innerHTML += '<br><small>' + pointProvider.innerText.trim() + '</small>';
                                    }
                                });
                            }
                        });
                    }
                    // Точка присутствия обращения.
                    var servicePoint = responseDiv.querySelector('#requestSource a');
                    if (servicePoint) {
                        getFromUrl(servicePoint.href, true, function(response) {
                            var responseDiv = document.createElement ('div');
                            responseDiv.innerHTML = response;
                            response = null;
                            var pointProvider = responseDiv.querySelector('#providerOU');
                            if (pointProvider) {
                                responsibleOuter.children[0].innerHTML += '<br><small>' + pointProvider.innerText.trim() + '</small>';
                            }
                        });
                    }
                });
            }
        }
    }
}

//////////////////////////////////////////////////////
//////////////////////////////////////////////////////
/////// Окно смены ответственного за обращение ///////
//////////////////////////////////////////////////////
//////////////////////////////////////////////////////
expr = /activeComponent=Request\.(setStageResponsible|delegateToEmployee)/;
if (expr.test(window.location.href)) {
    // Редактор в окне смены ответственного за обращение.
    let textarea = document.querySelector('#cause');
    if (textarea) {
        doEditor(textarea, answerTemplates.changeResponsibleTemplate[1].split('\n'));
    }
}

///////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////
/////// Окна смены состояния/ответственного заявки/обращения/задачи ///////
///////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////
expr = /activeComponent=(Deal\.setDealState|Request\.(setStageResponsible|delegateToEmployee)|CRMProblem\.setState)/;
if (expr.test(window.location.href)) {
    let statesel = document.querySelector('#state');
    if (statesel) {  // TODO: Проверить актуальность.
        let options = statesel.options;
        // Выбираем по умолчанию состояние "Закрыто".
        let firstLoad = document.querySelector('input[name="first_load"]');
        if (options[statesel.selectedIndex].value != 'wstagefs000080000jfrsq10nqrnejd0') {
            if (firstLoad.value == 'true') {
                changeSel('wstagefs000080000jfrsq10nqrnejd0', statesel, true);
            }
        }
    }

    let textarea = document.querySelector('#detailedCause');
    if (textarea) {
        // Редактор в окне смены ответственного за обращение.
        doEditor(textarea, answerTemplates.setTaskStateTemplate[1].split('\n'), true);

        // Копирование причины отмены задачи.
        let comCancel = document.querySelector('#comcancel') || document.querySelector('#cause_of_cancel');
        if (comCancel) {
            comCancel.onfocus = function() {
                if (comCancel.value === '') {
                    comCancel.value = textarea.value;
                }
            }
            textarea.onfocus = function() {
                if (textarea.value === '') {
                    textarea.value = comCancel.value;
                }
            }
        }
    }

    // Полный список сотрудников в окне смены ответственного за обращение
    let resSel = document.getElementById('responsible') || document.getElementById('Responsible') ||
        document.getElementById('target') || document.getElementById('factperformer');
    if (resSel) {
        if (parameters.fullsizeSelects[2] === '1') {
            resSel.addEventListener('click', function(){doSelect(this);}, false);
        }
        resSel.style.minWidth = '90%';
        var defResSel = resSel.innerHTML;

        var resButtons = document.createElement ('div');
        resButtons.id = 'resButtons';
        resSel.parentNode.insertBefore(resButtons, resSel.parentNode.children[1]);

        var defButton = document.createElement ('button');
        defButton.innerHTML = 'Стандартный список';
        defButton.setAttribute('type', 'button');
        defButton.style.display = 'none';
        defButton.id = 'defButton';
        defButton.onclick = function() {
            resSel.innerHTML = defResSel;
            document.querySelector('#defButton').style.display = 'none';
            var buttons = document.querySelectorAll('.depButton');
            for (let j=0; j<buttons.length; j++) {
                buttons[j].style.display = '';
            }
            resSel.size = 1;
        };
        resButtons.appendChild(defButton, resButtons);

        for (let depId in responsibles) {
            if (responsibles[depId] == 'break') {
                resButtons.appendChild(document.createElement('br'), resButtons);
            }
            else {
                var depButton = document.createElement('button');
                depButton.innerHTML = responsibles[depId][0];
                depButton.title = responsibles[depId][1];
                depButton.setAttribute('type', 'button');
                depButton.className = 'depButton';
                depButton.id = depId;
                depButton.onclick = function() {
                    resSel.innerHTML = '';
                    document.querySelector('#defButton').style.display = '';
                    var buttons = document.querySelectorAll('.depButton');
                    for (let j=0; j<buttons.length; j++) {
                        buttons[j].style.display = 'none';
                    }
                    let nbsp = '&nbsp;'.repeat(12),
                        allWorkers = getWorkers(this.id);
                    for (let res in allWorkers) {
                        let option = document.createElement('option');
                        option.innerHTML = nbsp + allWorkers[res] + nbsp;
                        option.value = res;
                        resSel.appendChild(option);
                    }
                    if (parameters.fullsizeSelects[2] === '1') {
                        resSel.size = resSel.getElementsByTagName('option').length;
                    }
                };
                resButtons.appendChild(depButton, resButtons);
            }
        }
    }

    // Добавляем ответственное подразделение слева от выбора.
    if (parameters.responsibleDepartment[2] === '1') {
        let responsibleOuter = document.querySelector('#Responsible_outer');
        if (responsibleOuter) {
            var taskUrl = '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + getParameterFromUrl('uuid');
            getFromUrl(taskUrl, true, function(response) {
                var responseDiv = document.createElement ('div');
                responseDiv.innerHTML = response;
                response = null;
                var reqLink = responseDiv.querySelector('#context a');
                if (reqLink) {
                    getFromUrl(reqLink.href, true, function(response) {
                        var responseDiv = document.createElement ('div');
                        responseDiv.innerHTML = response;
                        response = null;
                        // Список услуг обращения.
                        var reqService = responseDiv.querySelector('#services a');
                        if (reqService) {
                            getFromUrl(reqService.href, true, function(response) {
                                var responseDiv = document.createElement ('div');
                                responseDiv.innerHTML = response;
                                response = null;
                                var servicePoint = responseDiv.querySelector('#Service\\.ListsParent\\.ListsParent2\\.PointsOfPresence a[href*="uuid=poppfx"]');
                                if (servicePoint) {
                                    getFromUrl(servicePoint.href, true, function(response) {
                                        var responseDiv = document.createElement ('div');
                                        responseDiv.innerHTML = response;
                                        response = null;
                                        var pointProvider = responseDiv.querySelector('#providerOU');
                                        if (pointProvider) {
                                            responsibleOuter.children[0].innerHTML += '<br><small>' + pointProvider.innerText.trim() + '</small>';
                                        }
                                    });
                                }
                            });
                        }
                        // Точка присутствия обращения.
                        var servicePoint = responseDiv.querySelector('#requestSource a');
                        if (servicePoint) {
                            getFromUrl(servicePoint.href, true, function(response) {
                                var responseDiv = document.createElement ('div');
                                responseDiv.innerHTML = response;
                                response = null;
                                var pointProvider = responseDiv.querySelector('#providerOU');
                                if (pointProvider) {
                                    responsibleOuter.children[0].innerHTML += '<br><small>' + pointProvider.innerText.trim() + '</small>';
                                }
                            });
                        }
                    });
                }
            });
        }
    }
}

/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
/////// Окно редактирования дополнительной информации ///////
/////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////
expr = /activeComponent=Clients\.ListsParent\.ListsParent2\.workflowFlexAttributes\.editGroup/;
if (expr.test(window.location.href)) {
    // Редактор в окне добавления комментария.
    let textarea = document.querySelector('#otherStuff');

    if (textarea) {
        doEditor(textarea, answerTemplates.additionalInfoTemplate[1].split('\n'));
    }
}

//////////////////////////////////
//////////////////////////////////
/////// Окно выдачи задачи ///////
//////////////////////////////////
//////////////////////////////////
expr = /activeComponent=ProblemsTAB.CRMTasksList.CRMTasksListActionContainer.ObjectListReport.tableListAndButtons.CRMTasksList.AddCRMProblem/;
if (expr.test(window.location.href)) {
    // Автозаполнение окна выдачи задачи.
    let sel = document.getElementById('case');
    if (sel.selectedIndex === 0) {
        var options = sel.options;
        for (let i = 0; i < options.length; i++) {
            if (options[i].value == 'exit_to_client') sel.selectedIndex = i;
        }
        window.document.getElementById('refresh').click();
        throw 'reload';
    }
    else {
        var text = document.getElementById('text');
        if (text) {
            // Заполняем описание задачи информацией из обращения.
            if (text.value === '') {
                var historyUrl = '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' +
                    getParameterFromUrl('uuid') + '&activeComponent=History';
                getFromUrl(historyUrl, true, function(response) {
                    var responseDiv = document.createElement ('div');
                    responseDiv.innerHTML = response;
                    response = null;
                    var taskDescription = responseDiv.querySelector('#History\\.History tr:last-child td:nth-child(5)');
                    if (taskDescription) {
                        text.value = taskDescription.innerText.trim().replace(/  +/g, ' ').replace(/\n{2}(?!\n)|\n+(?=\n\n)/g, '\n');
                        text.selectionStart = 0;
                        text.selectionEnd = text.value.length;
                    }
                });
            }
            text.focus();
        }

        let resSel = document.getElementById('responsible');
        if (sel.options[sel.selectedIndex].value == 'exit_to_client') {
            let responsibles = {
                corebofs000080000kcods1j94s04hkc: 'Приморское',
                corebo180580g0000i8li59umgdbb8jk: 'Север',
                corebo180580g0000i8li59ve7r4g57g: 'Центр В.О.',
                corebofs000080000j1tbl5qvngcb3jk: 'Московское',
                corebofs000080000k4ck7u40c0fqovg: 'Выездная ТП'
            };

            for (let res in responsibles) {
                let button = document.createElement ('button');
                button.id = res;
                button.innerHTML = responsibles[res];
                button.setAttribute('type', 'button');
                button.onclick = function() {changeSel(this.id, 'responsible', false);};
                resSel.parentNode.insertBefore(button, resSel);
            }
        }
    }

    // Добавляем ответственное подразделение слева от выбора.
    if (parameters.responsibleDepartment[2] === '1') {
        let responsibleOuter = document.querySelector('#responsible_outer');
        if (responsibleOuter) {
            let reqUrl = '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + getParameterFromUrl('uuid');
            getFromUrl(reqUrl, true, function(response) {
                var responseDiv = document.createElement ('div');
                responseDiv.innerHTML = response;
                response = null;
                // Список услуг обращения.
                var reqService = responseDiv.querySelector('#services a');
                if (reqService) {
                    getFromUrl(reqService.href, true, function(response) {
                        var responseDiv = document.createElement ('div');
                        responseDiv.innerHTML = response;
                        response = null;
                        var servicePoint = responseDiv.querySelector('#Service\\.ListsParent\\.ListsParent2\\.PointsOfPresence a[href*="uuid=poppfx"]');
                        if (servicePoint) {
                            getFromUrl(servicePoint.href, true, function(response) {
                                var responseDiv = document.createElement ('div');
                                responseDiv.innerHTML = response;
                                response = null;
                                var pointProvider = responseDiv.querySelector('#providerOU');
                                if (pointProvider) {
                                    responsibleOuter.children[0].innerHTML += '<br><small>' + pointProvider.innerText.trim() + '</small>';
                                }
                            });
                        }
                    });
                }
                // Точка присутствия обращения.
                var servicePoint = responseDiv.querySelector('#requestSource a');
                if (servicePoint) {
                    getFromUrl(servicePoint.href, true, function(response) {
                        var responseDiv = document.createElement ('div');
                        responseDiv.innerHTML = response;
                        response = null;
                        var pointProvider = responseDiv.querySelector('#providerOU');
                        if (pointProvider) {
                            responsibleOuter.children[0].innerHTML += '<br><small>' + pointProvider.innerText.trim() + '</small>';
                        }
                    });
                }
            });
        }
    }
}

/////////////////////////////////////////////
/////////////////////////////////////////////
/////// Окно анкеты контроля качества ///////
/////////////////////////////////////////////
/////////////////////////////////////////////
expr = /activeComponent=Request.ListsParent.ListsParent2.anketa.editGroup/;
if (expr.test(window.location.href)) {
    // Автозаполнение анкеты контроля качества.
    var worksheetCloseButton = document.getElementById('Close');
    if (worksheetCloseButton) {
        var worksheetCustomButtons = document.createElement ('span');
        worksheetCustomButtons.innerHTML = '<button id="myButtonFill" type="button">Заполнить форму</button> &nbsp' +
            '<button id="myButtonClear" type="button">Очистить форму</button> &nbsp';
        worksheetCloseButton.parentNode.insertBefore(worksheetCustomButtons, worksheetCloseButton);
        document.getElementById('myButtonFill').addEventListener('click', function() {fillInputs(true);}, false);
        document.getElementById('myButtonClear').addEventListener('click', function() {clearInputs();}, false);
    }
}

/////////////////////////////////////////////
/////////////////////////////////////////////
/////// Окно изменения списка сервисов //////
/////////////////////////////////////////////
/////////////////////////////////////////////
expr = /activeComponent=Parameters\.ListsParent\.ListsParent2\.ServicesList\.EditEmployeeServices/;
if (expr.test(window.location.href)) {
    let servicesSelect = document.querySelector('#services');
    if (servicesSelect) {
        let options = servicesSelect.querySelectorAll('option'),
            selectCell = servicesSelect.parentNode,
            servicesText = document.createElement('textarea');
        servicesText.style.minWidth = '89%';
        servicesText.style.minHeight = '100px';
        for (let i = 0; i < options.length; i++) {
            if (options[i].value !== '--Folder--' && options[i].selected) {
                servicesText.value += options[i].innerText.trim() + '\n';
            }
        }
        servicesText.oninput = function() {
            let lines = servicesText.value.split('\n');
            for (let i = 0; i < options.length; i++) {
                options[i].selected = false;
                for (let l = 0; l < lines.length; l++) {
                    let optionText = options[i].innerText.trim(),
                        searchText = lines[l];
                    if (optionText === searchText) options[i].selected = true;
                }
            }
        }
        selectCell.insertBefore(servicesText, servicesSelect);
    }
}

console.log('Synchronous part of userscript finished.');

//////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////
/////// Автоподбор размера окна (постсинхронная часть) ///////
//////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////
if (resizeNeeded) { // Отслеживаем изменения на странице.
    observer.observe(document, {childList: true, subtree: true});
}

/////////////////////////////
/////////////////////////////
/////// Общие функции ///////
/////////////////////////////
/////////////////////////////
function resizeWindow (firstRun=true) { // Функция установки оптимального размера и положения окна.
    console.log('resizeWindow started.');
    // Вычисляем габариты рамок окна и скроллбаров и складываем с полными шириной и высотой страницы.
	var vpWidth = document.body.clientWidth,
        vpHeight = document.body.clientHeight,
        frameWidth = window.outerWidth - vpWidth,
        frameHeight = window.outerHeight - vpHeight,
        pageWidth = document.documentElement.clientWidth,
        pageHeight = document.documentElement.clientHeight,
        optimalWidth = frameWidth + pageWidth,
        optimalHeight = frameHeight + pageHeight;

    // Меняем размер окна только если текущие оптимальные размеры отличаются от предшествующих.
    if (optimalWidth != lastOptimalWidth || optimalHeight != lastOptimalHeight) {
        //console.log("vpWidth:", vpWidth, " vpHeight:", vpHeight);
        //console.log("frameWidth:", frameWidth, " frameHeight:", frameHeight);
        //console.log("pageWidth:", pageWidth, " pageHeight:", pageHeight);
        //console.log("optimalWidth:", optimalWidth, " optimalHeight:", optimalHeight);

        // Меняем размер окна.
        window.resizeTo(Math.min(screen.availWidth, optimalWidth), Math.min(screen.availHeight, optimalHeight));
        if (firstRun) resizeTimeout = setTimeout(function(){resizeWindow(false);}, parameters.autoResizeTimeout[2]/2);
        // Правим положение окна в Firefox.
        if (navigator.userAgent.indexOf("Firefox") > 0) {
            // Поднимаем окно, если оно опустилось ниже видимой части экрана.
            var needMoveUp = window.screenY + Math.min(screen.availHeight, optimalHeight) - screen.availHeight;
            if (needMoveUp > 0) window.moveBy(0, 0 - needMoveUp);
        }

        // Сохраняем последние оптимальные размеры окна
        lastOptimalWidth = optimalWidth;
        lastOptimalHeight = optimalHeight;
        console.log('resizeWindow finished.');
    }
    else {
        console.log('resizeWindow not needed.');
    }
}

function resizer (element, sizeName) {
    //console.log('resizer started.');
    var resizer = document.createElement ('div');
    resizer.style.cursor = 'n-resize';
    resizer.style.background = 'repeating-linear-gradient(0deg, rgba(240,240,240,0.7), rgba(240,240,240,0.7) 1px, rgba(120,120,120,0.7) 1px, rgba(120,120,120,0.7) 2px)';
    resizer.style.height = '6px';
    element.insertBefore(resizer, element.children[0]);
    resizer.mousemove = function (event) {
        event.preventDefault();
        event.stopPropagation();
        var height = Math.max(element.clientHeight - event.movementY, 50);
        if ((height + 50) < element.parentElement.clientHeight) {
            element.style.height = height + 'px';
        }
    };

    resizer.onmousedown = function () {
        try {
            document.body.style.userSelect = 'none';
            document.documentElement.addEventListener('mousemove', resizer.doDrag, false);
            document.documentElement.addEventListener('mouseup', resizer.stopDrag, false);
        } catch (error) {}
    };

    resizer.doDrag = function (event) {
        if (event.which != 1){
            resizer.stopDrag(event);
            return;
        }
        resizer.mousemove(event);
    };

    resizer.stopDrag = function () {
        document.documentElement.removeEventListener('mousemove', resizer.doDrag, false);
        document.documentElement.removeEventListener('mouseup', resizer.stopDrag, false);
		    sessionStorage[sizeName] = element.style.height;
        element.parentElement.style.paddingBottom = element.style.height;
        document.body.style.userSelect = '';
    };
    //console.log('resizer finished.');
}

function searchKeywords (string, keywords) { // Функция поиска ключевых слов в строке
    keywords = keywords.toLowerCase().replace(/\s/, ' ').trim().split(' ');
    string = string.toLowerCase();
    for (let i = 0; i<keywords.length; i++) {
        if (string.indexOf(keywords[i]) == -1) {
            return false;
        }
    }
    return true;
}

function insertAfter(elem, refElem) {
    var parent = refElem.parentNode;
    var next = refElem.nextSibling;
    if (next) {
        return parent.insertBefore(elem, next);
    }
    else {
        return parent.appendChild(elem);
    }
}

function getFromUrl (url, async, doOnReady) { // Функция запросов по url.
    var request = new XMLHttpRequest();
    request.open('GET', url, async);
    //request.setRequestHeader("X-Requested-With", "XMLHttpRequest");

    if (async) {
        request.onload = function() {
            if (typeof doOnReady !== 'undefined') {
                doOnReady(request.responseText);
            }
        };
        request.send();
    }
    else {
        request.send();
        if (request.readyState == 4) {
            if (typeof doOnReady !== 'undefined') {
                doOnReady(request.responseText);
            }
        }
    }
}

function getFromUrlPost (url, async, data, doOnReady) { // Функция запросов по url.
    var request = new XMLHttpRequest();

    var requestData = new FormData();
    request.open('POST', url, async);
    //request.setRequestHeader("X-Requested-With", "XMLHttpRequest");

    if (typeof data === 'object') {
        for (let key in data) {
            requestData.append(key, data[key]);
        }
    }
    else if (typeof data === 'string') {
        request.setRequestHeader('Content-Type', 'application/x-www-form-urlencoded');
        requestData = data;
    }
    else return 0;

    if (async) {
        request.onload = function() {
            if (typeof doOnReady !== 'undefined') {
                doOnReady(request.responseText);
            }
        };
        request.send(requestData);
    }
    else {
        request.send(requestData);
        if (request.readyState == 4) {
            if (typeof doOnReady !== 'undefined') {
                doOnReady(request.responseText);
            }
        }
    }
}

function getWorkers (department, recursive) { // Функция получения полного списка сотрудников СТП.
    //console.log('getWorkers started.');
    if (typeof recursive === 'undefined') {
        recursive = true;
    }
    if (department) {
        // Формируем ссылку.
        var url = '/fx/$guic/ru.naumen.guic.components.trees.objecttree_jsp?root=' + department +
            '&publishedUUID=fakeobcrmtree_object&activeComponentId=treeTab.objectsTree',
            workers = {};
        getFromUrl(url, false, function(response) {
            var responseDiv = document.createElement('div');
            responseDiv.innerHTML = response;
            response = null;
            // Получаем нужные нам строки.
            var rows = responseDiv.querySelectorAll('div>table>tbody>tr>td>table>tbody>tr');
            // Проходим по полученным строкам, игнорируя первую (ссылка на отдел).
            for (let i = 1; i < rows.length; i++) {
                // Если строка содержит ссылки на сотрудника, получаем имя и идентификатор.
                if (rows[i].querySelector('img[src="$bk/images/person.gif"]')) {
                    var urls = rows[i].querySelectorAll('a');
                    for (let j = 0; j < urls.length; j++) {
                        if (urls[j].childNodes.length == 1) {
                            workers[getParameterFromUrl('uuid', urls[j].href)] = urls[j].innerText;
                        }
                    }
                }
                else {
                    // Или добавляем сотрудников подразделов, рекурсивным вызовом.
                    if (recursive && rows[i].querySelector('img[src="$bk/images/ou.gif"]')) {
                        var subworkers = getWorkers(getParameterFromUrl('uuid', rows[i].querySelector('a').href));
                        for (let key in subworkers) {
                            workers[key] = subworkers[key];
                        }
                    }
                }
            }
        });
        //console.log('getWorkers finished.');
        return workers;
    }
    else return {};
}

function getReqPreview (reqid) { // Функция получения предпросмотра обращения.
    //console.log('getReqPreview started.');
    for (let i = 0; i < prevLinks.childNodes.length; i++) {
        prevLinks.childNodes[i].remove();
    }
    for (let i = 0; i < prevHist.childNodes.length; i++) {
        prevHist.childNodes[i].remove();
    }
    var prevLinksContent = document.createElement('div');
    var prevHistContent = document.createElement('div');
    prevLinks.appendChild(prevLinksContent);
    prevHist.appendChild(prevHistContent);
    prevPlaceholder.innerHTML = '<b>Загрузка...</b>';
    prevPlaceholder.style.display = '';
    var reqUrl = '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + reqid;
    getFromUrl(reqUrl, true, function(response) {
        prevPlaceholder.style.display = 'none';
        let responseDiv = document.createElement ('div');
        responseDiv.innerHTML = response;

        // Заголовок обращения.
        var reqName = 'Название отсутствует';
        try {reqName = responseDiv.querySelector('.pageheader>tbody>tr:last-child>td').innerHTML;}
        catch (error) {}
        var reqAddress = '(адрес отсутствует)';
        let extComments = responseDiv.querySelector('#extComments'),
            clientRequisite = responseDiv.querySelector('#clientRequisite');
        if (extComments) {
            reqAddress = extComments.innerHTML.replace(/(.*Адрес: )(.*?)(<br>.*)/, '($2)');
        }
        else if (clientRequisite) {
            let servicesLink = responseDiv.querySelector('#services>a');
            if (servicesLink) {
                getFromUrl(servicesLink.href, false, function(response) {
                    let responseDiv = document.createElement ('div');
                    responseDiv.innerHTML = response;
                    let installationAddressObject = responseDiv.querySelector('#installationAddressObject');
                    if (installationAddressObject) {
                        reqAddress = '(' + installationAddressObject.innerHTML.trim() + ')';
                    }
                });
            }
        }

        var clientLinks = responseDiv.querySelectorAll('.navpath a[href*="published_jsp?uuid="]'),
            clientName = null,
            clientUrl = null,
            clientLink = '';
        if (clientLinks.length > 3) {
            clientName = clientLinks[3].innerText;
            clientUrl = clientLinks[3].href;
            clientLink = ' <a href="' + clientUrl + '" target="_blank">[' + clientName + ']</a>';
            reqName = reqName.replace(/ \[.*\]/, '');
        }

        prevLinksContent.innerHTML = '<p style="color:black; font-weight:bold; font-size:13px; margin:0 0 2px; overflow:hidden; white-space:nowrap;">' +
            '<a href="' + reqUrl + '" target="_blank">' + reqName + '</a>' + clientLink + ' <span style="font-weight:normal;">' + reqAddress + '</span></p>';

        // Добавляем ссылки со станицы обращения.
        var reqSetState = responseDiv.querySelector('#Request\\.setState');
        if (reqSetState) prevLinksContent.appendChild(reqSetState);
        var reqSetSResp = responseDiv.querySelector('#Request\\.setStageResponsible');
        if (reqSetSResp) prevLinksContent.appendChild(reqSetSResp);
        var reqDelegate = responseDiv.querySelector('#Request\\.delegateToEmployee');
        if (reqDelegate) prevLinksContent.appendChild(reqDelegate);
        var reqAComment = responseDiv.querySelector('#Request\\.RequestHistory\\.AddCRMComment');
        if (reqAComment) prevLinksContent.appendChild(reqAComment);

        // Добавляем ссылку [выдать задачу].
        prevLinksContent.innerHTML += '<a onclick="open_in_new_window(window.event, \'/fx/$guic/ru.naumen.guic.components.forms.form_jsp?uuid=' + reqid +
            '&activeComponent=ProblemsTAB.CRMTasksList.CRMTasksListActionContainer.ObjectListReport.tableListAndButtons.CRMTasksList.AddCRMProblem\'' +
            ', \'form\', 330, 140); return false;" href="/fx/$guic/ru.naumen.guic.components.forms.form_jsp?uuid=' + reqid +
            '&activeComponent=ProblemsTAB.CRMTasksList.CRMTasksListActionContainer.ObjectListReport.tableListAndButtons.CRMTasksList.AddCRMProblem">[выдать задачу]</a>';

        // Ссылки на связанные услуги.
        var reqServices = '';
        try {
            reqServices = responseDiv.querySelector('#services').innerHTML.replace(/<br>/g, ', ').replace(/_top/g, '_blank').replace(/ \(ФЛ\)/g, '').trim();
        } catch (error) {}
        reqServices = reqServices === '' ? '<i>Услуги отсутствуют</i>' : 'Услуги: ' + reqServices;
        prevLinksContent.innerHTML += '<p id="reqServices" style="margin:5px 1px 0; overflow-x:hidden; white-space:nowrap;">' + reqServices +
            ' <a onclick="open_in_new_window(window.event, \'/fx/$guic/ru.naumen.guic.components.forms.form_jsp?uuid=' + reqid +
            '&activeComponent=Request.ListsParent.ListsParent1.systemAttributes.editGroup\', \'form\', 330, 140); return false;"' +
            'href="/fx/$guic/ru.naumen.guic.components.forms.form_jsp?uuid=' + reqid +
            '&activeComponent=Request.ListsParent.ListsParent1.systemAttributes.editGroup" target="_blank">[ред.]</a></p>';

        // Добавляем ответственное подразделение к списку услуг.
        if (parameters.responsibleDepartment[2] === '1') {
            var reqService = responseDiv.querySelector('#services a');
            if (reqService) {
                getFromUrl(reqService.href, true, function(response) {
                    var responseDiv = document.createElement ('div');
                    responseDiv.innerHTML = response;
                    var servicePoint = responseDiv.querySelector('#Service\\.ListsParent\\.ListsParent2\\.PointsOfPresence a[href*="uuid=poppfx"]');
                    if (servicePoint) {
                        getFromUrl(servicePoint.href, true, function(response) {
                            var responseDiv = document.createElement ('div');
                            responseDiv.innerHTML = response;
                            var pointProvider = responseDiv.querySelector('#providerOU');
                            if (pointProvider) {
                                prevLinksContent.querySelector('#reqServices').innerHTML += ' (' + pointProvider.innerText.trim() + ')';
                                reqInfoArr[reqid + '_links'] = prevLinksContent.cloneNode(true); // Копируем в кэш.
                            }
                        });
                    }
                });
            }
        }

        if (clientUrl) {
            // Загрузка КТ из карточки абонента.
            var clientNumbersCollection = {};
            getFromUrl(clientUrl, true, function(response) {
                var responseDiv = document.createElement ('div');
                responseDiv.innerHTML = response;
                // Извлекаем телефоны из раздела "Контактные лица".
                var linkedNumbers = responseDiv.querySelectorAll(
                    '#Clients\\.ListsParent\\.ListsParent1\\.JuridicalClientContactPersons a[href*="ciscotel:"]');
                for (let i=0; i<linkedNumbers.length; i++) {
                    var numberFromUrl = linkedNumbers[i].href.replace(/ciscotel:/, '');
                    numberFromUrl = numberFromUrl.length == 11 ? numberFromUrl : '8812' + numberFromUrl.substring(1);
                    clientNumbersCollection[numberFromUrl] = linkedNumbers[i].innerText.trim();
                }
                // Извлекаем телефоны из раздела "Контактная информация контрагента".
                var contactNumbersBlock = responseDiv.querySelector('#Clients\\.ListsParent\\.ListsParent1\\.contactInformation');
                if (contactNumbersBlock) {
                    modifyTextNodes(contactNumbersBlock);
                    var contactNumbers = contactNumbersBlock.querySelectorAll('a[href*="ciscotel:"]');
                    for (let c=0; c<contactNumbers.length; c++) {
                        clientNumbersCollection[contactNumbers[c].href.replace(/ciscotel:/, '')] = contactNumbers[c].innerText.trim();
                    }
                }

                var clientNumbersString = 'Контакты: ';
                for (let number in clientNumbersCollection) {
                    clientNumbersString += number + ', ';
                }
                var email = responseDiv.querySelector('#email');
                if (email) clientNumbersString += email.innerText.trim() === '' ? 'E-Mail отсутствует' : email.innerHTML.replace(/\s*<br>\s*/, ', ');

                // Добавляем информацию о миграции.
                let migration = responseDiv.querySelector('#migr_cont font');
                if (migration && migration.color === 'red') {
                    clientNumbersString += '&nbsp;&nbsp;&nbsp;<b style="color:red">' + migration.innerText + '</b>';
                }
                prevLinksContent.innerHTML += '<p style="margin:3px 1px 0; overflow-x:hidden; white-space:nowrap;">' + clientNumbersString + '</p>';

                // Делаем номера кликабельными.
                if (parameters.clickableLinks[2] === '1') {
                    modifyTextNodes(prevLinksContent);
                }
                reqInfoArr[reqid + '_links'] = prevLinksContent.cloneNode(true); // Копируем в кэш.
            });
        }

        // Копируем в кэш.
        reqInfoArr[reqid + '_links'] = prevLinksContent.cloneNode(true);
        // При предпросмотре в плавающем элементе, если он не помещается в видимую часть страницы, поднимаем вверх на собственную высоту.
        if (parameters.requestPreview[2] === '2' && !elementInViewport(prevFrame)) {
            prevFrame.style.marginTop = '-' + prevFrame.offsetHeight;
        }
    });

    var historyUrl = '/fx/$crm/ru.naumen.crm2.published_jsp?uuid=' + reqid + '&activeComponent=History';
    getFromUrl(historyUrl, true, function(response) {
        // Получаем таблицы из запрошенной страницы.
        let responseDiv = document.createElement ('div');
        responseDiv.innerHTML = response;
        let reqHist = responseDiv.querySelector('#History\\.History');
        if (reqHist) prevHistContent.appendChild(reqHist);
        // Делаем ссылки и номера кликабельными.
        if (parameters.clickableLinks[2] === '1') {
            modifyTextNodes(reqHist);
        }
        // Копируем в кэш.
        reqInfoArr[reqid + '_history'] = prevHistContent.cloneNode(true);
        // Получаем заметку по обращению.
        getLocalNote(reqid, prevHistContent);
        // Получаем предпросмотр задач.
        if (parameters.taskPreview[2] === '1') {
            getTaskPreview(prevHistContent);
        }
        // При предпросмотре в плавающем элементе, если он не помещается в видимую часть страницы, поднимаем вверх на собственную высоту.
        if (parameters.requestPreview[2] === '2' && !elementInViewport(prevFrame)) {
            prevFrame.style.marginTop = '-' + prevFrame.offsetHeight;
        }
    });
    //console.log('getReqPreview finished.');
}

function getLocalNote (uuid, parentDiv) {
    if (parameters.localNotes[2] === '1') {
        let notesObj = JSON.parse(localStorage.notesObj || '{}'),
            prev_div = document.querySelector('#localNoteDiv');
        if (prev_div) prev_div.remove();
        if (! notesObj[uuid]) notesObj[uuid] = {};
        notesObj[uuid].lastSeen = new Date * 1;

        let noteDiv = document.createElement('div');
        noteDiv.id = 'localNoteDiv';
        let noteDivText = 'Добавить локальную заметку';
        if (notesObj[uuid].textNote) {
            noteDivText = 'Локальная заметка: ' + notesObj[uuid].textNote;
            noteDivText = noteDivText > 200 ? noteDivText.substring(0, 200) + '...' : noteDivText;
        }
        noteDiv.innerHTML = '<span>' + noteDivText + '</span>';
        modifyTextNodes(noteDiv);
        noteDiv.title = 'Редактировать текст заметки';
        noteDiv.style.marginBottom = '1px';
        noteDiv.style.padding = '7px 5px';
        noteDiv.style.cursor = 'pointer';
        noteDiv.style.border = '1px solid #fff';
        noteDiv.style.background = 'rgba(220,220,220,0.4)';
        if (parentDiv.children[0]) parentDiv.insertBefore(noteDiv, parentDiv.children[0]);
        else parentDiv.appendChild(noteDiv);

        noteDiv.onclick = function(event) {
            if (event.target.matches('a')) return;

            let noteWrap = document.createElement('div');
            noteWrap.style.zIndex = '1015';
            noteWrap.style.position = 'fixed';
            noteWrap.style.top = '0px';
            noteWrap.style.left = '0px';
            noteWrap.style.width = '100%';
            noteWrap.style.height = '100%';
            noteWrap.style.background = 'rgba(50,50,50,0.5)';
            noteWrap.onkeypress = noteWrap.onclick = function(event) {
                if (event.target === noteWrap || event.keyCode === 10) { // 13 = Enter, 10 = Ctrl+Enter
                    let noteTextarea = noteWrap.children[0];
                    if (noteTextarea) {
                        notesObj[uuid].textNote = noteTextarea.value;
                        localStorage.notesObj = JSON.stringify(notesObj);
                        let noteDivText = 'Добавить локальную заметку';
                        if (notesObj[uuid].textNote) {
                            noteDivText = 'Локальная заметка: ' + notesObj[uuid].textNote;
                            noteDivText = noteDivText > 200 ? noteDivText.substring(0, 200) + '...' : noteDivText;
                        }
                        noteDiv.innerHTML = '<span>' + noteDivText + '</span>';
                        modifyTextNodes(noteDiv);
                    }
                    this.remove();
                }
            };
            document.body.appendChild(noteWrap);

            let noteTextarea = document.createElement('textarea');
            noteTextarea.placeholder = 'Введите текст заметки';
            noteTextarea.value = notesObj[uuid].textNote || '';
            noteTextarea.style.position = 'relative';
            noteTextarea.style.display = 'block';
            noteTextarea.style.top = '40%';
            noteTextarea.style.width = '50%';
            noteTextarea.style.height = 'calc(40% - 60px)';
            noteTextarea.style.maxHeight = 'calc(60% - 60px)';
            noteTextarea.style.resize = 'vertical';
            noteTextarea.style.overflowY = 'auto';
            noteTextarea.style.margin = 'auto';
            noteTextarea.style.padding = '30px';
            noteWrap.appendChild(noteTextarea);
            noteTextarea.focus();
            noteTextarea.selectionStart = 0;
            noteTextarea.selectionEnd = noteTextarea.value.length;

            // Блокируем прокрутку любых элементов, кроме блока настроек.
            noteWrap.onwheel = function(event) {
                // Если элемент события прокрутки не принадлежит истории, ничего не делаем.
                if (! isChildOf(event.target, noteWrap)) event.preventDefault();

                let area = noteTextarea,
                    delta = event.deltaY || event.detail || event.wheelDelta;

                if (delta < 0 && area.scrollTop === 0) {
                    event.preventDefault();
                }
                if (delta > 0 && area.scrollHeight - area.clientHeight - area.scrollTop <= 1) {
                    event.preventDefault();
                }
            };
        }
    }
    cleannotesObj();
}

function cleannotesObj () {
    if (parameters.localNotesTTL[2]*1 > 0) {
        let notesObj = JSON.parse(localStorage.notesObj || '{}');
        for (let key in notesObj) {
            let ttl = parameters.localNotesTTL[2] * 86400000;
            if (new Date * 1 - notesObj[key].lastSeen > ttl) {
                delete notesObj[key];
            }
        }
        localStorage.notesObj = JSON.stringify(notesObj);
    }
}

function getTaskPreview (obj, allTaskLinks) { // Функция предпросмотра задач.
    // Подбираем цвет для панели.
    var mainColor = getComputedStyle(document.body).getPropertyValue('background-color');

    // Если массива со ссылками нет, собираем его.
    if (typeof allTaskLinks === 'undefined') {
        allTaskLinks = Array.prototype.slice.call(obj.querySelectorAll('a[href*="uuid=crmtas"]'));
    }
    if (allTaskLinks.length > 0) {
        // Извлекаем первый элемент из массива.
        var curTaskLink = allTaskLinks.shift();
        //var taskId = getParameterFromUrl ('uuid', allLinks[i].href);
        var taskUrl = curTaskLink.href;
        var prevContainer = document.createElement ('div');
        prevContainer.className = 'task_preview';
        prevContainer.style.background = mainColor || '#ccc';
        prevContainer.style.border = '1px solid #888';
        prevContainer.style.boxSizing = 'border-box';
        prevContainer.style.overflowY = 'hidden';
        prevContainer.style.width = '100%';
        prevContainer.style.maxHeight = '23px';
        prevContainer.style.marginTop = '2px';
        prevContainer.style.fontStyle = 'initial';
        prevContainer.style.fontWeight = 'initial';
        prevContainer.style.textDecoration = 'none';
        prevContainer.style.display = 'inline-block';
        curTaskLink.parentNode.appendChild(prevContainer);

        var prevLinks = document.createElement('div');
        prevLinks.innerHTML = '<b>Загрузка...</b>';
        prevLinks.style.background = 'rgba(220,220,220,0.7)';
        prevLinks.style.padding = '3px';
        prevLinks.style.whiteSpace = 'nowrap';
        prevContainer.appendChild(prevLinks);

        var prevHist = document.createElement('div');
        prevHist.style.background = 'rgba(220,220,220,0.7)';
        prevHist.style.padding = '3px';
        prevHist.style.id = 'prevHistDiv';
        prevContainer.appendChild(prevHist);

        getFromUrl(taskUrl, true, function(response) {
            // Получаем таблицы из запрошенной страницы.
            var responseDiv = document.createElement ('div');
            responseDiv.innerHTML = response;

            var taskName = 'Название отсутствует';
            try {taskName = responseDiv.querySelector('.pageheader>tbody>tr:last-child>td').innerHTML;}
            catch (error) {}

            var taskStage = '';
            try {taskStage = ' [' + responseDiv.querySelector('#stage').innerText.trim() + ']';}
            catch (error) {}

            var taskReasons = '';
            try {taskReasons = responseDiv.querySelector('#reason_exit_dds').innerText;}
            catch (error) {}

            var taskDescr = 'Описание отсутствует';
            try {taskDescr = responseDiv.querySelector('#text').innerHTML;}
            catch (error) {}

            var taskCompleteDate = '';
            try {taskCompleteDate = responseDiv.querySelector('#completeDate').innerText.trim();}
            catch (error) {}

            var taskSwitchPort = '';
            try {taskSwitchPort = responseDiv.querySelector('#reservedSw').innerText.trim() + ':' +
                responseDiv.querySelector('#reservedSwPort').innerText.trim();}
            catch (error) {}

            var taskBalanceCorrection = '';
            try {taskBalanceCorrection = responseDiv.querySelector('#start_date_correct').innerText.trim() + ' - ' +
                responseDiv.querySelector('#finish_date_correct').innerText.trim() + ' (' +
                responseDiv.querySelector('#periodIndemnificationFull').innerText.trim() + ' дн.)';}
            catch (error) {}

            var taskCancelReason = '';
            try {taskCancelReason = responseDiv.querySelector('#comcancel').innerText.trim();}
            catch (error) {}

            var taskModelSerial = '';
            try {taskModelSerial = responseDiv.querySelector('#modelequip').innerText.trim() + ' (' +
                responseDiv.querySelector('#sn').innerText.trim() + ')';}
            catch (error) {}

            prevLinks.innerHTML = '<p class="header" style="font-weight:bold; font-size:13px; cursor:pointer; margin:0; overflow:hidden; white-space:nowrap;">' +
                taskName + '<span style="font-weight:normal;">' + taskStage + '</span></p><p style="font-weight:normal; font-size:11px; margin:0 0 2px;">' +
                taskReasons + '</p>';

            // Добавляем ссылки со станицы обращения.
            var reqSetState = responseDiv.querySelector('#CRMProblem\\.setState');
            if (reqSetState) {
                prevLinks.appendChild(reqSetState);
            }
            var reqSetResp = responseDiv.querySelector('#CRMProblem\\.setStageResponsible');
            if (reqSetResp) {
                prevLinks.appendChild(reqSetResp);
            }
            var reqEditTask = responseDiv.querySelector('#CRMProblem\\.ListsParent\\.ListsParent2\\.workflowFlexAttributes\\.editGroup');
            if (reqEditTask) {
                prevLinks.appendChild(reqEditTask);
            }
            var taskComment = responseDiv.querySelector('#CRMProblem\\.ListsParent\\.ListsParent1\\.commentsList\\.AddCRMComment');
            if (taskComment) {
                prevLinks.appendChild(taskComment);
            }

            prevHist.innerHTML = '<div style="color:black; margin:5px 0 10px; border:1px solid white; padding:3px; background:rgba(220,220,220,0.7)">' +
                taskDescr + '</div>';
            if (taskCompleteDate) {
                prevHist.innerHTML += '<div>Фактическое решение задачи: ' + taskCompleteDate + '</div>';
            }
            if (taskSwitchPort && taskSwitchPort != ':') {
                prevHist.innerHTML += '<div>Расположение на оборудовании: ' + taskSwitchPort + '</div>';
            }
            if (taskBalanceCorrection) {
                prevHist.innerHTML += '<div>Корректировка: ' + taskBalanceCorrection + '</div>';
            }
            if (taskModelSerial && taskModelSerial != ' ()') {
                prevHist.innerHTML += '<div>Оборудование: ' + taskModelSerial + '</div>';
            }
            if (taskCancelReason) {
                prevHist.innerHTML += '<div>Комментарий к отмене: "' + taskCancelReason + '"</div>';
            }
            prevHist.innerHTML += '<br>';
            var taskHist = responseDiv.querySelector('#CRMProblem\\.ListsParent\\.ListsParent2\\.StagesWorkflowHistrory');
            if (taskHist) {
                prevHist.appendChild(taskHist);
            }
            prevHist.innerHTML += '<br>';
            var taskComm = responseDiv.querySelector('#CRMProblem\\.ListsParent\\.ListsParent1\\.commentsList');
            if (taskComm) {
                prevHist.appendChild(taskComm);
            }
            // Делаем ссылки и номера кликабельными.
            if (parameters.clickableLinks[2] === '1') {
                modifyTextNodes(prevHist);
            }

            var taskCopy = document.createElement('a');
            taskCopy.innerHTML = '[копировать]';
            taskCopy.title = 'Копировать';
            taskCopy.href = '';
            taskCopy.onclick = function(event) {
                copyTaskInfo(event, responseDiv, taskHist);
            };
            prevLinks.appendChild(taskCopy);

            // Сворачивание/разворачивание элемента по клику на нём.
            prevContainer.querySelector('.header').addEventListener("click", function(event){
                if (this.parentNode.parentNode.style.maxHeight === '') {
                    this.parentNode.parentNode.style.maxHeight = '23px';
                    this.title = 'Развернуть';
                }
                else {
                    this.parentNode.parentNode.style.maxHeight = '';
                    this.title = 'Свернуть';
                }
            }, false);
            prevContainer.querySelector('.header').title = 'Развернуть';

            // Рекурсивно вызываем функцию снова, передавая массив в текущем состоянии.
            getTaskPreview(obj, allTaskLinks);
        });
    }
}

function copyTaskInfo (event, obj, taskHist) { // Функция копирования текста задач.
    event.preventDefault();
    var taskCopyText = '';
    // ФИО.
    try {taskCopyText += obj.querySelector('#context').innerText.match(/[^\[]*(?=\])/) + '\t';}
    catch (error) {taskCopyText += '-\t';}

    // Дата выдачи задачи.
    if (typeof taskHist === 'undefined') {
        taskHist = document.body.querySelector('#CRMProblem\\.ListsParent\\.ListsParent2\\.StagesWorkflowHistrory');
    }
    try {taskCopyText += taskHist.rows[1].children[1].innerText.trim() + '\t';}
    catch (error) {taskCopyText += '-\t';}

    // Каст и лицевой.
    try {taskCopyText += document.body.querySelector('#extComments').innerHTML.replace(/(.*\(физ.лица\) №)(.*?)(<br>.*)/, '$2').trim() + '\t';}
    catch (error) {
        // Получаем данные со страницы обращения.
        var reqUrl = obj.querySelector('#context a');
        try {
            getFromUrl(reqUrl.href, false, function(response) {
                var responseDiv = document.createElement ('div');
                responseDiv.innerHTML = response;
                taskCopyText += responseDiv.querySelector('#extComments').innerHTML.replace(/(.*\(физ.лица\) №)(.*?)(<br>.*)/, '$2').trim() + '\t';
            });
        }
        catch (error) {taskCopyText += '-\t';}
    }

    // Описание задачи.
    try {taskCopyText += obj.querySelector('#text').innerText.trim() + '\t';}
    catch (error) {taskCopyText += '-\t';}

    // Адрес выезда.
    try {taskCopyText += obj.querySelector('#srvInfo').innerHTML.replace(/(.*Санкт-Петербург,|.*Адреса.*<br>)(.*)/, '$2').trim() + '\t';}
    catch (error) {taskCopyText += '-\t';}

    // Контактные телефоны.
    try {taskCopyText += obj.querySelector('#requestData').innerText.match(/\d{10}/g).join(', ') + '\t';}
    catch (error) {taskCopyText += '-\t';}

    // Автор задачи.
    try {taskCopyText += '\t\t\t\t\t' + taskHist.rows[1].children[0].innerText.trim() + '\t';}
    catch (error) {taskCopyText += '\t\t\t\t\t-\t';}

    // Номер задачи.
    try {taskCopyText += obj.querySelector('#number').innerHTML.trim() + '\t';}
    catch (error) {taskCopyText += '-\t';}

    // Убираем переносы строк, лишние пробелы и копируем.
    copyText('Текст задачи:', taskCopyText.replace(/\n/g, ' ').replace(/  +/g, ' ').trim(), event);
    return false;
}

function hideInSearchResults (elem) {
    if (typeof elem === 'undefined') {
        elem = document;
    }
    if (parameters.hideInSearchResults[2] === '1') {
        let tableRows = elem.querySelectorAll('#advSearchTab\\.searchResults tr'),
            tableHeaders = elem.querySelectorAll('#advSearchTab\\.searchResults tr:first-child th'),
            longColumns = [];
        if (tableHeaders) {
            for (let i=0; i<tableHeaders.length; i++) {
                switch (tableHeaders[i].id) {
                    case 'advSearchTab.searchResults.deals.dealsheaderCell': {
                        longColumns.push(i);
                        break;
                    }
                    case 'advSearchTab.searchResults.services.servicesheaderCell': {
                        longColumns.push(i);
                        break;
                    }
                    case 'advSearchTab.searchResults.contracts.contractsheaderCell': {
                        longColumns.push(i);
                        break;
                    }
                    case 'advSearchTab.searchResults.cps.cpsheaderCell': {
                        longColumns.push(i);
                        break;
                    }
                }
            }
            for (let a = 0; a<longColumns.length; a++) {
                for (let i=1; i<tableRows.length; i++) {
                    let dealsCell = tableRows[i].children[longColumns[a]],
                        dealsLinks = dealsCell.querySelectorAll('a');
                    dealsCell.style.textAlign = 'center';
                    if (dealsLinks.length > 3) {
                        let counter = dealsLinks.length + declOfNum(dealsLinks.length, [' элемент', ' элемента', ' элементов']);
                        dealsCell.sourceHTML = counter + '<br><b>˄</b><br>' + dealsCell.innerHTML;
                        dealsCell.innerHTML = counter + '<br><b>˅</b>';
                        dealsCell.style.cursor = 'pointer';
                        dealsCell.title = 'Отобразить/скрыть';
                        dealsCell.onclick = function() {
                            if (this.sourceHTML !== '') {
                                let tmp = this.innerHTML;
                                this.innerHTML = this.sourceHTML;
                                this.sourceHTML = tmp;
                            }
                        }
                    }
                }
            }
        }
    }
}

function modifyTextNodes (obj) { // Делаем ссылки и номера кликабельными.
    if (! obj) {
        return null;
    }
    // Выражение для поиска нод, подходящих под КТ.
    var regex1 = /\D((\+?7|8(?! ?-?12)) ?-?)?(\(?\d{3}\)? ?-?)?(\d{3} ?-?)( ?\d{2} ?-?)( ?\d{2})\D/;
    // Выражение для получения номера в исходном виде.
    var regex2 = /((\+?7|8(?! ?-?12))[ -]?)?(\(?\d{3}\)?[ -]?)?(\d{3}[ -]?)( ?\d{2}[ -]?)( ?\d{2})(?!\d)/g;
    // Выражение для проверки на наличие ссылок.
    var regex3 = /(https?|ftp):\/\/\S*/;
    // Выражение для поиска всех ссылок.
    var regex4 = /(https?|ftp):\/\/\S*/g;

    // Собираем все дочерние элементы объекта.
    let allElements = obj.querySelectorAll('*');
    for (let i = 0; i < allElements.length; i++) {
        let element = allElements[i],
            elementMod = '',
            elementModLeft = element.innerHTML.replace(/&amp;/g, '&'), // Фикс "двойных" ссылок, при наличии амперсанда.
            needModify = false;
        // Перебираем внутренние ноды элемента.
        for (let j = 0; j < element.childNodes.length; j++) {
            // Работаем с текстовыми нодами.
            if (element.childNodes[j].nodeType == 3) {
                var textNode = element.childNodes[j],
                    substrArr = null;
                // Если элемент не является ссылкой или вложенным в ссылку.
                if (! element.matches('a') && ! element.matches('a *')) {
                    // Замена неразрывных пробелов, раздувающих страницу в ширину.
                    textNode.nodeValue = textNode.nodeValue.replace(/\s+/g, ' ');
                    // Ищем записи, похожие на ссылки.
                    if (regex3.test(textNode.textContent)) {
                        needModify = true;
                        // Получаем объект ссылок в текстовом виде из ноды.
                        var originalLinks = textNode.textContent.match(regex4);
                        if (originalLinks) {
                            for (let k = 0; k < originalLinks.length; k++) {
                                originalLinks[k] = originalLinks[k].replace(/[.:,]$/, '');
                                // Производим преобразование в кликабельную ссылку.
                                substrArr = elementModLeft.split(originalLinks[k]);
                                elementMod += substrArr.shift() + '<a target="_blank" href="' + originalLinks[k] + '">' + originalLinks[k] + '</a>';
                                elementModLeft = substrArr.join(originalLinks[k]);
                                substrArr = null;
                            }
                        }
                    }
                    else {
                        // Ищем записи, похожие на КТ, подставляя пробелы для исключения избыточных вхождений выражения.
                        if (regex1.test(' ' + textNode.textContent + ' ')) {
                            needModify = true;
                            // Получаем объект номеров в исходном виде из ноды.
                            var originalNumbers = textNode.textContent.match(regex2);
                            // Для каждого обнаруженного номера производим преобразование и подмену на ссылку.
                            if (originalNumbers) {
                                for (let o = 0; o < originalNumbers.length; o++) {
                                    var originalNumber = originalNumbers[o];
                                    // Убираем всё, кроме цифр, подставляем недостающие.
                                    var phoneNumber = originalNumber.replace(/\D/g, '');
                                    if (phoneNumber.length == 7) phoneNumber = '8812' + phoneNumber;
                                    else if (phoneNumber.length >= 10) phoneNumber = '8' + phoneNumber.substring(phoneNumber.length - 10);

                                    // Подмена текстовой записи на ссылку.
                                    substrArr = elementModLeft.split(originalNumber);
                                    elementMod += substrArr.shift() + '<a href="ciscotel:' + phoneNumber + '">' + originalNumber + '</a>';
                                    elementModLeft = substrArr.join(originalNumber);
                                    substrArr = null;
                                }
                            }
                        }
                    }
                }
            }
        }
        // Меняем код основного элемента, при необходимости.
        if (needModify) {
            element.innerHTML = elementMod + elementModLeft;
        }
    }

    // Вешаем копирование на все ссылки вида "ciscotel:".
    let allPhoneLinks = obj.querySelectorAll('a[href*="ciscotel:"]');
    for (let h = 0; h < allPhoneLinks.length; h++) {
        allPhoneLinks[h].style.textDecoration = 'underline';
        allPhoneLinks[h].title = 'Копировать (ПКМ)';
        allPhoneLinks[h].onmousedown = function(event) {
            if (event.button === 2) {
                //copyText('Номер телефона:', this.href.replace(/ciscotel:(8812)?/, ''), event);
                copyText('Номер телефона:', this.textContent.trim(), event);
                event.preventDefault();
                return false;
            }
        };
        allPhoneLinks[h].oncontextmenu = function(event) {
            event.preventDefault();
            return false;
        };
        if (allPhoneLinks[h].href === 'ciscotel:8null') {
            allPhoneLinks[h].remove();
        }
        let numberFromUrl = allPhoneLinks[h].href.replace(/ciscotel:8/, '');
        // Фикс для семизначных номеров.
        if (numberFromUrl.length === 7) {
            allPhoneLinks[h].href = 'ciscotel:8812' + numberFromUrl;
        }
        // Фикс для номеров, сохранённых через восьмёрку.
        if (numberFromUrl.length === 11) {
            allPhoneLinks[h].href = 'ciscotel:' + numberFromUrl;
        }
    }
}

function copyText (caption, text, event) {
    var copyTextarea = null;
    try {
        copyTextarea = document.createElement('textarea');
        copyTextarea.value = text;
        copyTextarea.style.position = 'absolute';
        document.body.appendChild(copyTextarea);
        copyTextarea.select();

        var copyState = document.execCommand('copy');
        copyTextarea.remove();
        if (! copyState) {
            window.prompt('Требуется ручное копирование.\n' + caption, text);
        }
        else {
            //var el = document.createElement('div');
            //el.setAttribute('style', 'position:absolute; top:' + (event.pageY - 10) + '; left:' + (event.pageX + 10) +
            //'; background-color:white; z-index:1007; padding:2px; white-space:nowrap;');
            //el.innerHTML = 'Скопировано в буфер обмена';
            //document.body.appendChild(el);
            //if (! elementInViewport(el)) el.style.marginLeft = 0 - el.offsetWidth - 20;
            //setTimeout(function() {if (el) el.remove();}, 1000);
        }
    } catch (error) {
        console.log('Copying failed! Probably your browser don\'t support "execCommand".');
        if (copyTextarea) {
            copyTextarea.remove();
        }
        window.prompt('Требуется ручное копирование.\n' + caption, text);
    }
}

function getParameterFromUrl (name, url) { // Функция получения get-запроса из url.
    if (!url) url = window.location.href;
    name = name.replace(/[\[\]]/g, '\\$&');
    var regex = new RegExp('[?&]' + name + '(=([^&#]*)|&|#|$)'),
        results = regex.exec(url);
    if (!results) return null;
    if (!results[2]) return '';
    return decodeURIComponent(results[2].replace(/\+/g, ' '));
}

function isChildOf (child, parent) { // Проверка дочерности элемента.
    var node = child.parentNode;
    while (node !== null) {
        if (node == parent) {
            return true;
        }
        node = node.parentNode;
    }
    return false;
}

function changeSel (item, select, refresh) { // Функция выбора элемента option в select по его value.
    if (typeof refresh === 'undefined') {
        refresh = true;
    }
    if (typeof select === 'string') {
        select = document.getElementById(select);
    }
    if (typeof select === 'object') {
        var options = select.options;
        for (let i = 0; i < options.length; i++) {
            if (options[i].value == item) {
                select.selectedIndex = i;
                if (refresh) {
                    window.document.getElementById('refresh').click();
                    throw 'reload';
                }
            }
        }
    }
}

function doSelect (sel, doAfter, noResize) { // Функция сомнительного улучшения select.
    if (! noResize && parameters.autoResize[2] === '1' && resizeNeeded) {
        observer.observe(sel, {attributes: true});
    }
    if (sel.size == 1) {
        sel.size = sel.getElementsByTagName('option').length;
    }
    else {
        sel.size = 1;
        if (doAfter) doAfter();
    }
    if (! elementInViewport(sel)) sel.scrollIntoView();
}

function elementInViewport (el) { // Функция проверки нахождения элемента в поле видимости.
    var top = el.offsetTop;
    var left = el.offsetLeft;
    var width = el.offsetWidth;
    var height = el.offsetHeight;

    while(el.offsetParent) {
        el = el.offsetParent;
        top += el.offsetTop;
        left += el.offsetLeft;
    }

    return (
        top >= window.pageYOffset &&
        left >= window.pageXOffset &&
        (top + height) <= (window.pageYOffset + window.innerHeight) &&
        (left + width) <= (window.pageXOffset + window.innerWidth)
    );
}

function fillInputs (quality) { // Функция автозаполнения анкеты.
    var inputsArr = document.querySelectorAll('input[value="000000_да"]');
    for (let x = 0; x < inputsArr.length; x++) {
        if (quality && inputsArr[x].id == 'qualservSTP') inputsArr[x].checked = true;
        else if (quality && inputsArr[x].id == 'timemaster') inputsArr[x].checked = true;
        else if (quality && inputsArr[x].id == 'vyezdres') inputsArr[x].checked = true;
        else if (quality && inputsArr[x].id == 'qualservspec') inputsArr[x].checked = true;
        else if (inputsArr[x].id == 'contragentConfirmation_2') inputsArr[x].checked = true;
    }
    inputsArr = document.querySelectorAll('input[value="000001_Нет"]');
    if (inputsArr.length == 1 && inputsArr[0].id == 'needPay1') inputsArr[0].checked = true;
    inputsArr = document.querySelectorAll('input[value="000002_Акт не требуется "]');
    if (quality && inputsArr.length == 1 && inputsArr[0].id == 'actdonework') inputsArr[0].checked = true;
    inputsArr = document.querySelectorAll('input[value="000002_Оплата не требуется "]');
    if (quality && inputsArr.length == 1 && inputsArr[0].id == 'paydopwork') inputsArr[0].checked = true;

    var selReason = document.getElementById('problemReason');
    if (selReason && selReason.selectedIndex === 0) {
        selReason.selectedIndex = selReason.options.length - 1;
    }
    var needCont = document.getElementById('needCont');
    if (needCont) needCont.checked = false;
    var needPay = document.getElementById('needPay');
    if (needPay) needPay.checked = false;
    if (document.getElementById('cancel')) window.scrollTo(0, document.body.scrollHeight);
}

function clearInputs () { // Функция сброса выбранного в анкете.
    var allRadio = document.querySelectorAll('input[type="radio"]');
    for (let x = 0; x < allRadio.length; x++) {
        allRadio[x].checked = false;
    }
}

function doEditor (textarea, answersArr, notags) { // Функция создания текстового редактора
    var editorContainer = document.createElement('div');
    editorContainer.style.padding = '4px 0px';
    editorContainer.style.minWidth = '400px';
    textarea.parentNode.insertBefore(editorContainer, textarea);

    if (parameters.textEditor[2] === '1') {
        if (! notags) {
            var tagButtons = {
                b: ['<b>B</b>', 'Жирный текст'],
                i: ['<i>I</i>', 'Наклонный текст'],
                u: ['<u>U</u>', 'Подчёркнутый текст'],
                h1: ['H1', 'Заголовок первого уровня']
            };
            for (let tagButt in tagButtons) {
                var editorTagButton = document.createElement('button');
                editorTagButton.type = 'button';
                editorTagButton.value = tagButt;
                editorTagButton.className = 'editorAddTag';
                editorTagButton.innerHTML = tagButtons[tagButt][0];
                editorTagButton.title = tagButtons[tagButt][1];
                editorContainer.appendChild(editorTagButton);
            }

            var customTagButtons = {
                Quote: ['| Цитата |','Вставить цитату'],
                Bl: ['Blink', 'Мигающий текст'],
                Url: ['Url', 'Ссылка, открывающаяся в новой вкладке'],
                Telnet: ['Telnet', 'Telnet-ссылка'],
                Image: ['Image', 'Встраиваемое изображение'],
                break1: 'break'
            };
            for (let custTagButt in customTagButtons) {
                if (customTagButtons[custTagButt] == 'break') {
                    editorContainer.appendChild(document.createElement('br'));
                }
                else {
                    var editorCustTagButton = document.createElement('button');
                    editorCustTagButton.type = 'button';
                    editorCustTagButton.innerHTML = customTagButtons[custTagButt][0];
                    editorCustTagButton.title = customTagButtons[custTagButt][1];
                    editorCustTagButton.className = 'editor' + custTagButt;
                    editorContainer.appendChild(editorCustTagButton);
                }
            }
        }

        var otherButtons = {
            Clear: ['Очистить', 'Очистить текстовое поле'],
            Trim: ['Trim', 'Убрать избыточные пробелы и переносы строк'],
            EnRu: ['En->Ru', 'Исправить раскладку текста в поле/выделенного текста'],
            RuEn: ['Ru->En', 'Исправить раскладку текста в поле/выделенного текста'],
            Preview: ['Предпросмотр', 'Предварительный просмотр текста'],
            Inet: ['Internet','Diaga'],
            Telephony: ['Telephony','Diaga'],
            break1: 'break'
        };
        for (let butt in otherButtons) {
            if (otherButtons[butt] == 'break') {
                editorContainer.appendChild(document.createElement('br'));
            }
            else {
                var editorOtherButton = document.createElement('button');
                editorOtherButton.type = 'button';
                editorOtherButton.innerHTML = otherButtons[butt][0];
                editorOtherButton.title = otherButtons[butt][1];
                editorOtherButton.className = 'editor' + butt;
                editorContainer.appendChild(editorOtherButton);
            }
        }

        textarea.parentNode.onclick = function(event) {
            var button = event.target;
            if (button.type != 'button') {
                button = button.parentNode;
            }
            if (button.type == 'button') {
                var len = textarea.value.length,
                    start = textarea.selectionStart,
                    end = textarea.selectionEnd,
                    sel = textarea.value.substring(start, end).trim(),
                    selReplacement = '';

                if (button.className == 'editorAddTag') {
                    selReplacement = ` <${button.value}>${sel}</${button.value}> `;
                    textarea.value = textarea.value.substring(0, start) + selReplacement + textarea.value.substring(end, len);
                }
                if (button.className == 'editorQuote') {
                    selReplacement = ` <p style="border:1px solid rgba(0,0,0,0.5);margin:2px;padding:6px;border-radius:6px;background-color:rgba(255,255,255,0.5)">${sel}</p> `;
                    textarea.value = textarea.value.substring(0, start) + selReplacement + textarea.value.substring(end, len);
                }
                if (button.className == 'editorInet') {
                    selReplacement = `Интернет:
- Причина обращения клиента (не работает/потери/прерывания/низкая скорость)
- Перезагрузка оборудования клиента (да/нет)
- IP клиента
- Свич-порт
- Особенности включения (если есть, например, модемы/медики/рм)
- Результаты диагностики порта (статус, линк, ошибки)
- Результаты проверки MAC-адреса и влана
- Сессия (есть/нет)
- Переподнимается ли корректно после сброса (если есть)
- Что удалось выяснить при диагностике совместно с клиентом
- Какие действия выполнили (перезапуск порта/сброс сессии и др.)
- Что нужно сделать
`;
                }
                if (button.className == 'editorTelephony') {
                    selReplacement = `Телефония:
- С каким номером наблюдается сложность
- Причина обращения клиента (не проходят входящие и/или исходящие звонки, плохая слышимость, не проходят некоторые звонки, не работает ПА и т.д.)
- Регистрация номера (была/есть)
- С какого IP регистрация номера
- Примеры проблемных или тестовых звонков (Номер А, номер Б, время)
Если наш ГШ включен на нашей сети:
- Свитч/порт подключения ГШ (наличие линк/мак/влан/связность)
- ARP от ГШ (есть/нет)
- Ping ГШ с роутера (есть/нет)
- Перезагрузка ГШ (была/нет)
`;
                }
                if (button.className == 'editorUrl') {
                    var url = window.prompt('Enter the URL:','http://');
                    if (! url) return;
                    selReplacement = ` <a href="${url}" target="_blank"><u><b>${sel}</b></u></a> `;
                    textarea.value = textarea.value.substring(0, start) + selReplacement + textarea.value.substring(end, len);
                }
                if (button.className == 'editorTelnet') {
                    if (sel === '') sel = window.prompt('Введите IP-адрес коммутатора:', '172.17.');
                    if (! sel) return;
                    sel = sel.replace(/ /g, '').replace(/,/g, '.');
                    var regex = /^([0-9]{1,3})\.([0-9]{1,3})\.([0-9]{1,3})\.([0-9]{1,3})$/;
                    if (! regex.test(sel)) {
                        sel = '172.17.' + sel;
                    }
                    if (regex.test(sel)) {
                        selReplacement = ` <a href="telnet://${sel}"><b><u>${sel}</u></b></a> `;
                        textarea.value = textarea.value.substring(0, start) + selReplacement + textarea.value.substring(end, len);
                    }
                    else window.alert('Недопустимое значение IP-адреса!');
                }
                if (button.className == 'editorImage') {
                    var urli = window.prompt('Enter the Image URL:','http://');
                    if (! urli) return;
                    selReplacement = ` <img src="${urli}"> `;
                    textarea.value = textarea.value.substring(0, start) + sel + selReplacement + textarea.value.substring(end, len);
                }
                if (button.className == 'editorBl') {
                    expr = /activeComponent=Clients\.ListsParent\.ListsParent2\.workflowFlexAttributes\.editGroup/;
                    if (expr.test(window.location.href) && textarea.value.length > 78) {
                        window.alert('Поле может вмещать не более 78 символов, помимо скрипта!');
                        return;
                    }
                    selReplacement = ` <bl>${sel}</bl> `;
                    textarea.value = textarea.value.substring(0, start) + selReplacement + textarea.value.substring(end, len);
                    textarea.value = textarea.value.trim();
                    var script = '\n<script>setInterval(function(){var l=document.querySelectorAll("bl");' +
                        'for(var e=0;e<l.length;e++)l[e].style.visibility=l[e].style.visibility?"":"hidden"},600);</script>';
                    if (textarea.value.indexOf(script) == -1) {
                        textarea.value += script;
                    }
                }
                if (button.className == 'editorTrim') {
                    textarea.value = textarea.value.replace(/(\t| )+\n/g, '\n').replace(/(\t| )+/g, ' ').trim();
                }
                if (button.className == 'editorClear') {
                    textarea.value = '';
                }
                if (button.className == 'editorEnRu' || button.className == 'editorRuEn') {
                    if (sel === '') {
                        sel = textarea.value;
                        textarea.value = '';
                    }
                    var replacer = {};
                    if (button.className == 'editorEnRu') {
                        replacer = { // Eng -> Rus
                        'q':'й', 'w':'ц', 'e':'у', 'r':'к', 't':'е', 'y':'н', 'u':'г', 'i':'ш', 'o':'щ', 'p':'з', '[':'х',
                        '{':'Х', ']':'ъ', '}':'Ъ', 'a':'ф', 's':'ы', 'd':'в', 'f':'а', 'g':'п', 'h':'р', 'j':'о', 'k':'л',
                        'l':'д', ';':'ж', ':':'Ж', '\'':'э', '"':'Э', 'z':'я', 'x':'ч', 'c':'с', 'v':'м', 'b':'и', 'n':'т',
                        'm':'ь', ',':'б', '<':'Б', '.':'ю', '>':'Ю', '/':'.', '?':',', '\\':'\\', '@':'"', '#':'№', '$':';',
                        '^':':', '&':'?', '`':'ё', '~':'Ё', '|':'/'
                        };
                    }
                    else {
                        replacer = { // Rus -> Eng
                        'й':'q', 'ц':'w', 'у':'e', 'к':'r', 'е':'t', 'н':'y', 'г':'u', 'ш':'i', 'щ':'o', 'з':'p', 'х':'[',
                        'Х':'{', 'ъ':']', 'Ъ':'}', 'ф':'a', 'ы':'s', 'в':'d', 'а':'f', 'п':'g', 'р':'h', 'о':'j', 'л':'k',
                        'д':'l', 'ж':';', 'Ж':':', 'э':'\'', 'Э':'"', 'я':'z', 'ч':'x', 'с':'c', 'м':'v', 'и':'b', 'т':'n',
                        'ь':'m', 'б':',', 'Б':'<', 'ю':'.', 'Ю':'>', '.':'/', ',':'?', '\\':'\\', '"':'@', '№':'#', ';':'$',
                        ':':'^', '?':'&', 'Ё':'~', 'ё':'`', '/':'|'
                        };
                    }

                    for (let key in replacer) {
                        replacer[key.toUpperCase()] = replacer[key.toUpperCase()] || replacer[key].toUpperCase();
                    }

                    selReplacement = sel.replace(/[A-zА-я/<>\{\},.;:\'"\]\[\?@#$&^`~|№ёЁ]/g, function(x) {
                        return replacer[x] || x;
                    });
                    textarea.value = textarea.value.substring(0, start) + ' ' + selReplacement + ' ' + textarea.value.substring(end, len);
                }
                if (button.className == 'editorPreview') {
                    var editorPreview = document.getElementById('editorPreview');
                    if (! editorPreview) {
                        editorPreview = document.createElement ('div');
                        editorPreview.id = 'editorPreview';
                        editorPreview.style.background = '#ddd';
                        editorPreview.style.padding = '4px';
                        editorPreview.style.color = '#060606';
                        editorPreview.style.width = '100%';
                        editorPreview.style.height = 'auto';
                        editorPreview.style.border = '1px solid #777';
                        editorPreview.style.whiteSpace = 'pre-wrap';
                        editorPreview.style.boxSizing = 'border-box';
                        document.body.appendChild (editorPreview);
                    }
                    editorPreview.innerHTML = `<div id="caption" style="margin-bottom: 5px; color: #555;">Предпросмотр:</div><div id="prevtext" style="margin: 5px;">${textarea.value}</div>`;
                    editorPreview.scrollIntoView();
                }

                textarea.value = textarea.value.replace(/  +/g, ' ').replace(/\n /g, '\n').trim();
                textarea.value = textarea.value.replace(/\s\./, '.');
                textarea.focus();

                // Сохраняем выделение текста.
                if (parameters.textEditorBehavior[2] === '1' && selReplacement !== '') {
                    selReplacement = selReplacement.trim();
                    textarea.selectionStart = textarea.value.indexOf(selReplacement);
                    textarea.selectionEnd = textarea.value.indexOf(selReplacement) + selReplacement.length;
                }
                else {
                    textarea.selectionStart = textarea.value.length;
                }

                event.stopPropagation(); // Препятствуем распространению события на родительские элементы.
            }
        };
    }

    // Выбор шаблонов ответа.
    if (parameters.textTemplates[2] === '1' && answersArr) {
        if (parameters.textEditor[2] === '1') {
            editorContainer.innerHTML += '<br>';
        }
        var editorAnswer = document.createElement('select');
        editorAnswer.style.minWidth = '220px';
        editorAnswer.style.maxWidth = '300px';
        editorAnswer.style.whiteSpace = 'normal';
        editorAnswer.setAttribute('size', '1');
        for (let i = 0; i<answersArr.length; i++) {
            var optionText = answersArr[i].length > 38 ? answersArr[i].substring(0,38) + '...' : answersArr[i];
            var optionTitle = answersArr[i].length > 38 ? '...' + answersArr[i].substring(38) : '';
            editorAnswer.innerHTML += `<option title="${optionTitle}" value="${answersArr[i]}">${optionText}</option>`;
        }
        editorContainer.appendChild(editorAnswer);
        if (parameters.fullsizeSelects[2] === '1') {
            editorAnswer.onclick = function() {
                if (this.options[this.selectedIndex].text !== '') {
                    doSelect(this, function() {
                        var len = textarea.value.length,
                            start = textarea.selectionStart,
                            end = textarea.selectionEnd;
                        textarea.value = textarea.value.substring(0, start) + ' ' + editorAnswer.options[editorAnswer.selectedIndex].value +
                            ' ' + textarea.value.substring(end, len);
                        textarea.value = textarea.value.replace(/  +/g, ' ').replace(/\n /g, '\n').trim();
                        textarea.selectionStart = textarea.value.length;
                    });
                }
            };
        }
        else {
            editorAnswer.onchange = function() {
                var len = textarea.value.length,
                    start = textarea.selectionStart,
                    end = textarea.selectionEnd;
                textarea.value = textarea.value.substring(0, start) + ' ' + editorAnswer.options[editorAnswer.selectedIndex].value +
                    ' ' + textarea.value.substring(end, len);
                textarea.value = textarea.value.replace(/  +/g, ' ').replace(/\n /g, '\n').trim();
                textarea.selectionStart = textarea.value.length;
            };
        }
        var editorAnswerButton = document.createElement('button');
        editorAnswerButton.setAttribute('type', 'button');
        editorAnswerButton.style.verticalAlign = 'top';
        editorAnswerButton.style.padding = '0 2px';
        editorAnswerButton.style.fontSize = 'larger';
        editorAnswerButton.innerHTML = '&#8628;';
        editorAnswerButton.onclick = function() {
            var len = textarea.value.length,
                start = textarea.selectionStart,
                end = textarea.selectionEnd;
            textarea.value = textarea.value.substring(0, start) + ' ' + editorAnswer.options[editorAnswer.selectedIndex].value +
                ' ' + textarea.value.substring(end, len);
            textarea.value = textarea.value.replace(/  +/g, ' ').replace(/\n /g, '\n').trim();
            textarea.selectionStart = textarea.value.length;
        };
        editorContainer.appendChild(editorAnswerButton);
    }

    textarea.focus();
    if (parameters.textEditorHot[2] === '1') {
        textarea.focus();
        textarea.addEventListener('keydown', function(event) {
            if ((event.ctrlKey || event.metaKey) && ['KeyB', 'KeyI', 'KeyU', 'KeyH', 'KeyK', 'KeyY'].includes(event.code)) {
                event.preventDefault();

                const start = this.selectionStart;
                const end = this.selectionEnd;
                const len = this.value.length;
                let sel = this.value.substring(start, end);
                let selReplacement = '';

                switch (event.code){
                    case 'KeyB': selReplacement = ` <b>${sel}</b> `; break;
                    case 'KeyI': selReplacement = ` <i>${sel}</i> `; break;
                    case 'KeyU': selReplacement = ` <u>${sel}</u> `; break;
                    case 'KeyH': selReplacement = ` <h1>${sel}</h1> `; break;
                    case 'KeyK':
                        var url = window.prompt('Ссылка:', 'http://');
                        if (! url) return;
                        selReplacement = ` <a href="${url}" target="_blank"><u><b>${sel}</b></u></a> `;break;
                    case 'KeyY': selReplacement = ` <p style="border:1px solid rgba(0,0,0,0.5);margin:2px;padding:6px;border-radius:6px;background-color:rgba(255,255,255,0.5)">${sel}</p> `; break;
                }

                this.value = this.value.substring(0, start) + selReplacement + this.value.substring(end, len);
                this.value = this.value.trim();

                if (parameters.textEditorBehavior[2] === '1' && selReplacement !== '') {
                    this.selectionStart = this.value.indexOf(selReplacement);
                    this.selectionEnd = this.value.indexOf(selReplacement) + selReplacement.length;
                } else {
                    this.selectionStart = this.value.indexOf(selReplacement) + selReplacement.length;
                    this.selectionEnd = this.selectionStart;
                }
            }
        });}
}

function declOfNum(number, titles) {
    let cases = [2, 0, 1, 1, 1, 2];
    return titles[ (number%100>4 && number%100<20)? 2 : cases[(number%10<5)?number%10:5] ];
}

function timeFrom(time) {
    let delta = new Date - time,
        result = '';
    switch (true) {
        case delta > 1000 * 60 * 60 * 24: {
            result += parseInt((delta / (1000 * 60 * 60 * 24))) + 'дн ';
            result += parseInt((delta / (1000 * 60 * 60)) % 24) + 'ч ';
            result += parseInt((delta / (1000 * 60)) % 60) + 'м ';
            result += parseInt((delta / 1000) % 60) + 'с назад';
            break;
        }
        case delta > 1000 * 60 * 60: {
            result += parseInt((delta / (1000 * 60 * 60)) % 24) + 'ч ';
            result += parseInt((delta / (1000 * 60)) % 60) + 'м ';
            result += parseInt((delta / 1000) % 60) + 'с назад';
            break;
        }
        case delta > 1000 * 60: {
            result += parseInt((delta / (1000 * 60)) % 60) + 'м ';
            result += parseInt((delta / 1000) % 60) + 'с назад';
            break;
        }
        case delta > 1000: {
            result += parseInt((delta / 1000) % 60) + 'с назад';
            break;
        }
        default: {
            result += 'только что'
            break;
        }
    }
    return result;
}


const ipElements = Array.from(document.querySelectorAll('#services a, #Service\\.ListsParent\\.ListsParent1\\.ServicesList a, #ipAddress')).filter(element => {
    return /\b\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\b/.test(element.innerText);
}).forEach(element => {
    const ipMatch = element.innerText.match(/\b\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\b/)[0];
    if (ipMatch) {
        if (document.querySelectorAll('#ipAddress'))element.innerHTML += ` - <u><a href="http://iupd-tech2.v.westcall.net/networks/ip-info/${ipMatch}" title="Проверить сессию (IUPD)" target="_blank" style=":">[Найти сессию]</a></u>`;
        else element.outerHTML += ` - <u><a href="http://iupd-tech2.v.westcall.net/networks/ip-info/${ipMatch}" title="Проверить сессию (IUPD)" target="_blank">[Найти сессию]</a></u>`;
    }
});

var domenname = document.getElementById('domenname');
if (domenname!=undefined){domenname.innerHTML += ` - <u><a href="https://admin.westcall.cloud/#/domains?sortOrder=asc&sortBy=name&search=${domenname.innerText}" title="Перейти на портал ОАТС" target="_blank">[Портал ОАТС])</a></u>`}

if (parameters.colorHistory[2] === '1') {
    table = document.getElementById(`Request.RequestHistory`);
    if (!table) return;
    //console.log (table)
    let table_row = table.rows;
    for (let i = 0; i<table_row.length; i++) {
        table_cells = table_row[i].cells;
        if (i==0){
            for (let c in table_cells){
                if (table_cells[c].innerText == `Состояние обращения`){table_status_col = c;}
                if (table_cells[c].innerText == `Комментарий`){table_desc_col = c;}
                if (table_cells[c].innerText == `Ответственный за состояние`){table_user_col = c;}
                if (table_cells[c].innerText == `Ответственный за состояние`){table_user_col = c;}
            }
        }
        //table_cells[table_desc_col].innerText = null;
        switch(table_cells[table_status_col].innerText){
            case "ожидание действий клиента":
            case "Запланирована дата обработки": table_cells[table_status_col].setAttribute("style", "background-color:#AD66D5A0");break;
            case "Запланирована дата обработки (снятие переадр)":
            case "Запланирована дата обработки (установка переадр)": table_cells[table_status_col].setAttribute("style", "background-color:#7D256FA0");break;
            case "отправлено в обработку":
            case "передано в работу (напр тех под В2В)": table_cells[table_status_col].setAttribute("style", "background-color:#FF7D73A0");break;
            case "закрыто": table_cells[table_status_col].setAttribute("style", "background-color:#a5a5a5A0");break;
            case "выполнено": table_cells[table_status_col].setAttribute("style", "background-color:#28a745f0");break;
            case "принято в обработку":
            case "принято в работу": table_cells[table_status_col].setAttribute("style", "background-color:#28a745A0");break;
            case "Авария": table_cells[table_status_col].setAttribute("style", "background-color: red");break;
            case "передать в новый отдел-исполнитель": table_cells[table_status_col].setAttribute("style", "background-color:#0000ff70");break;
            case "зарегистрировано в РАБОЧЕЕ время":
            case "зарегистрировано в НЕРАБОЧЕЕ время": table_cells[table_status_col].setAttribute("style", "background-color:#ffff0070");break;
        }
    }
}


if (parameters.taskKrus[2] === '1') {
    // Цвет ссылки — в отдельной переменной
    const LINK_COLOR = '#2c0d5e';

    table = document.getElementById(`Request.RequestHistory`);
    if (!table) return;
    let table_row = table.rows;
    // Находим номер столбца "Комментарий"
    let table_desc_col = -1;
    for (let i = 0; i < table_row.length; i++) {
        let table_cells = table_row[i].cells;
        for (let c in table_cells) {
            if (table_cells[c].innerText.trim() === 'Комментарий') {
                table_desc_col = c;
                break;
            }
        }
        if (table_desc_col !== -1) break;
    }

    // Если столбец не найден — ошибка
    if (table_desc_col === -1) {
        console.error("Столбец 'Комментарий' не найден.");
        return;
    }

    // Обрабатываем каждую строку
    for (let i = 0; i < table_row.length; i++) {
        let table_cells = table_row[i].cells;
        if (table_desc_col >= 0 && table_cells.length > table_desc_col) {
            let cellText = table_cells[table_desc_col].innerText;

            // Ищем все совпадения маски
            let matches = cellText.match(/([А-Яа-я]{3}\d{7})/g);

            if (matches) {
                // Обновляем текст: заменяем каждое совпадение на ссылку
                let updatedText = cellText;

                // Шаг 1: обрабатываем переносы строк — удаляем начальные/конечные \n, а остальные заменяем на <br>
                let lines = cellText.split('\n');
                let cleanedLines = [];
                for (let line of lines) {
                    line = line.trim();
                    if (line) {
                        cleanedLines.push(line);
                    }
                }
                let cleanedText = cleanedLines.join('<br>');

                // Шаг 2: заменяем совпадения маски на ссылки
                for (let match of matches) {
                    let krusId = match.slice(3); // Извлекаем цифры после 3 букв
                    let link = `<a href="https://cliks.ertelecom.ru/modules/mod_ticket_search.php?krus_id=${krusId}&service_code=&but_search_krus=" target="_blank" style="font-weight: bold; color: ${LINK_COLOR}; text-decoration: underline;" title="Проверить ТТ">${match}</a>`;
                    updatedText = updatedText.replace(match, link);
                }

                // Шаг 3: вставляем <br> только в нужных местах — если текст не пустой, и мы не в начале/конце
                let finalText = updatedText;
                let finalLines = finalText.split('\n');
                let finalCleanedLines = [];
                for (let line of finalLines) {
                    line = line.trim();
                    if (line) {
                        finalCleanedLines.push(line);
                    }
                }
                finalText = finalCleanedLines.join('<br>');

                // Обновляем ячейку
                table_cells[table_desc_col].innerHTML = finalText;
            }
        }
    }
}